{
    "cik": "1433195",
    "company": "APPFOLIO INC",
    "filing_type": "10-K",
    "filing_date": "2022-02-28",
    "period_of_report": "2021-12-31",
    "sic": "7372",
    "state_of_inc": null,
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1433195/0001433195-22-000023-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1433195/000143319522000023/appf-20211231.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1433195/0001433195-22-000023.txt",
    "filename": "10K_1433195_20211231_0001433195-22-000023.htm",
    "item_1": "ITEM 1. BUSINESS\nUnless otherwise stated in this Annual Report, references to \"AppFolio,\" \"we,\" \"us,\" and \"our\" refer to AppFolio, Inc. and its consolidated subsidiaries.\nOverview\nAppFolio is a leading provider of cloud business management solutions for the real estate industry. Our solutions enable our customers to digitally transform their businesses, automate and streamline critical business operations and deliver a better customer experience.\nWe were founded in 2006 with the vision to revolutionize vertical industry businesses by providing great software and services. Our mission is even more relevant today, as digital transformation is effectively a requirement for business success in the modern world, and the way we work and live today requires powerful software solutions.\nAppFolio solutions are designed to meet that need in the real estate industry, and assist an increasingly interconnected and growing ecosystem of users, including property managers, property owners, real estate investment managers, rental prospects, residents, and service providers, with critical transactions across the real estate lifecycle, including screening potential tenants, sending and receiving payments and even providing insurance-related risk mitigation services. AppFolio’s intuitive interface, coupled with streamlined and automated workflows, make it easier for our customers to eliminate redundant and manual processes so they can deliver a great experience for their users while improving financial and operational performance.\nOur platform and mobile-optimized solutions are designed for use across multiple devices and operating systems, and to be a system of record to centralize and automate these essential business processes, a system of engagement to enhance business interactions between our customers and their business ecosystems, and a system of intelligence to leverage data to predict and optimize business workflows in order to enable exceptional customer experiences and increase efficiency across our customers' businesses. Our solutions are offered as a service, and are hosted using a modern cloud-based architecture.\nWe rely on strategic partners and third-party service providers to deliver certain aspects of our solutions, and we strive to provide a seamlessly integrated experience for our customers. We believe our customer-centric culture empowers a focus on customer satisfaction that leads to long-term retention and, ultimately, to our long-term success. Our commitment to building innovative products, delivering exceptional customer experiences, and nurturing our company culture has led AppFolio to be listed as a 2020 and 2021 Fortune 100 Fastest Growing Company.\nOur Core Solutions\nOur Platform\nAppFolio’s platform addresses important aspects of workflows common to property management and is frequently updated in response to market trends and customer needs. Further, we believe that partnering and integrating with curated third party solutions to enable important functionality for our customers while maintaining an elevated customer experience will benefit our customer base over time. Core functionality of our services addresses key operational issues, including accounting, business analytics and management, marketing and leasing functionality, maintenance and operational efficiency, as well as communications with key stakeholders.\nAppFolio Property Manager\nAppFolio Property Manager provides the platform upon which property managers can run their business operations. Property management companies choose AppFolio Property Manager to leverage the benefits of process automation, an easy-to-use interface, and the optimization of common workflows. Customers include third-party property managers and owner-operators, who typically manage single- and multi-family residential properties, and others who manage community association, and commercial properties.\nAppFolio Property Manager serves as our customers’ system of record with accounting functionality at the core. All critical transactions are completed and recorded in the system and give our customers access to the data they need to run their business. AppFolio Property Manager is also the system of engagement that customers use to interact with the residents living at their properties, the owners and investors owning those properties, and vendors providing products and services to the properties. Both aspects of the system are inherently interconnected so that the day-to-day interactions, such as residents paying rent through the AppFolio Property Manager mobile app, are instantly reflected in the system of record. For our customers, AppFolio Property Manager's mobile capabilities enable their teams to be productive regardless of their location, responding to leasing inquiries, addressing work orders, or completing inspections on the go. Due to their distributed nature, this is especially relevant for our property management customers with a significant portion of single-family or small multi-family properties.\nAppFolio Property Manager Plus\nWe continue to serve customers with larger and more complex portfolios with AppFolio Property Manager Plus, recognizing the evolving needs these customers have for deeper business insights, automation, and more advanced customer experiences. These customers typically have a more diverse mix of property types, a wider geographical dispersion of their properties, and the larger teams necessary to manage those types of portfolios. AppFolio Property Manager Plus is designed to solve these challenges in multiple ways: through customizable workflows that allow customers to digitize their existing processes; by providing performance insights; through intelligent revenue management; through integrations with a set of carefully selected partners; and through dedicated strategic account managers that help customers realize the full benefit of our solution.\nValue Added Services\nAppFolio Property Manager’s optional but often mission-critical Value Added Services are designed to enhance, automate and streamline business-critical processes and workflows. These services build on functionality and workflows in our solutions and generally fall into the categories of marketing and leasing, electronic payment services, business optimization, and risk mitigation (e.g., insurance-related services). Although many of our Value Added Services are enabled by third-party partners, we strive for a seamless experience for our customers that increases their efficiency while not sacrificing ease of use of AppFolio Property Manager and AppFolio Property Manager Plus. Utilization and adoption of our Value Added Services is typically higher for residential properties than community association or commercial properties because of the unique and complex needs of the residential rental lifecycle.\nWe empower our customers and users with a wide variety of Value Added Services, primarily:\n•Electronic Payment Services. Our electronic payment services allow property managers to streamline their receivables and payables through a variety of online payment options. Customers can collect funds through our secure online portal, our mobile application and/or via electronic cash payments from various users, including applicants, residents and property owners. Types of funds that may be collected include rental application fees, security deposits, rent payments, and other tenant charges; contributions from property owners; and periodic dues from those living in community associations. Customers can also electronically send funds to various users, including distributions to property owners; payments to service providers; and payment to their own management company.\n•Tenant Screening Services. Our tenant screening services include background screening, credit checks, income verification, and a streamlined rental history verification process for use in connection with the rental application process.\n•Insurance. Through partnerships and wholly-owned subsidiaries, we make available certain risk mitigation services. Our liability to landlord insurance product allows our property management customers to enforce insurance coverage requirements within their leases by tracking coverage of their units and adding uncovered units to a qualifying liability to landlord insurance policy via a licensed insurance broker, while renters insurance protects the personal belongings of renters, as well as the property itself, from certain unexpected damages.\nWe experience some seasonality in our Value Added Services revenue. See Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional details regarding seasonality of revenue.\nOur Growth Strategy\nOur growth strategy in the near term is to provide increasingly valuable business management solutions to new and existing customers in the real estate industry. We are leveraging this growing footprint to expand both within the property management market as well as into adjacent markets. We define adjacent markets as markets that have both real estate and non-real estate characteristics. Key components of our near and extended term growth strategy include:\nMaintain Product and Technology Leadership. We have made and will continue to make significant investments in research and new product development to expand our platform capabilities. We intend to continue using our market validation techniques and close relationships with our customers and users as a key source of feedback to inform and direct our product strategy. We may also choose to acquire rather than build certain technology capabilities, or to partner and integrate with curated third parties to deliver key functionality to serve the needs of our customers and their business ecosystems, all while maintaining a superior customer experience.\nKeep Our Existing Customers and Users Happy. We believe customer success is essential to our long-term success, and we strive to have loyal and engaged long-term customer relationships. We place significant emphasis on customer experience to differentiate our solutions from competing products. This emphasis will continue to be a critical component of our growth strategy in the future. We believe that maintaining our focus on customer success will lead to new product innovation, the referral of new customers from existing satisfied customers, and greater adoption and utilization of our solutions.\nAcquire New Customers. We believe new customer acquisition is essential to our long-term success. We expect to continue to grow our base of customers, and thus the number of units managed on our platform, with continued investments in the development of increasingly valuable business management solutions across not only the existing property types we currently serve but new ones as well, innovative sales and marketing programs, including evolving real estate industry thought leadership and education, and the referral power of satisfied customers. To continue to attract larger customers, we may increase our utilization of partnerships and integrations with select third parties to deliver key functionality.\nExpand Adoption and Use By Existing Customers. We have made, and will continue to make, significant investments in our solutions that expand functionality and enhance or add new capabilities to meet the current and evolving needs of our customers. We expect our satisfied customers will expand their adoption and usage of our Value Added Services to adapt our platform to their specific operational requirements. In addition, as our customers grow, we expect they will continue to use our solutions to manage their larger businesses. To facilitate the continued use of our solutions by larger customers, we may increase our utilization of partnerships and integrations with select third parties to deliver key functionality while maintaining an elevated customer experience.\nEnter New Adjacent Markets. We expect to continue to evaluate and expand into adjacent markets (as defined above) based on our market validation strategy and targeted customer feedback in a manner consistent with our strategic plan. While we are continuously developing our real estate industry solutions within a given market, we believe we can apply certain relevant product features and key learnings from that market to find synergies and new opportunities as we extend our solutions into successive adjacent markets. An example of our adjacent market expansion effort is AppFolio Investment Management, which we released in April 2019 and is designed to enable real estate investment management organizations to better manage investor relationships by increasing transparency and streamlining certain business processes. By leveraging our knowledge and expertise in the real estate industry to grow AppFolio Investment Management, we may eventually develop investment management solutions for markets in other industries.\nOur Customers\nWe define customers as those paying for a subscription to our core solutions. As of December 31, 2021, we had 17,215 property management customers. No individual customer represented 10% or more of our total revenue for fiscal 2021.\nCustomer Service\nWe believe our success is tied to long-term customer relationships, not a one-time sale. Our team is structured to deliver ongoing service; this includes ongoing live and on-demand training, a library of resources, and personalized account management. We regularly measure NPS and solicit customer feedback in a variety of ways in an effort to continue to better serve our customers. Our solutions are designed to be easy to use and manage, and we offer training and support at no extra charge.\nOnboarding consists of a dedicated team that works to ensure that customers are prepared to run their businesses on our platform. As a result of our assistance with data migration matters, we are able to provide valuable insights into data integrity and work with our customers to help resolve any issues in their underlying business processes. We also assist our customers with the configuration of our products for particular property types, as appropriate. We share insights on best practices for the markets we serve and dedicate resources to guide our customers through the adoption and utilization of our Value Added Services.\nSales and Marketing\nWe leverage a modern and scalable marketing approach along with marketing automation technology to attract and engage prospects and build brand recognition as an industry leader. We participate in industry thought leadership and education, and we use a variety of inbound and outbound marketing techniques to promote AppFolio solutions.\nOur business development team acts in partnership with our marketing and sales teams to reach potential customers, generate sales opportunities, and accelerate the time from evaluation to close. Our sales representatives assist prospective customers as they evaluate our products. Our interactive sales methodology allows our sales team to quickly build relationships, assess our customers’ business challenges, and demonstrate the benefits of our core functionality and, where applicable, Value Added Services.\nTechnology and Operations\nOur products are powered by a highly scalable computing platform and are designed with a strong focus on data security and availability. We use Ruby-on-Rails as our primary web application framework, and we take great care to keep this application framework and the rest of our software stack current in order to mitigate known security vulnerabilities. Our computing platform and cloud infrastructure are primarily powered by Amazon Web Services’ Elastic Compute Cloud (EC2) platform. In order to ensure that data is not lost and that customer requests can be satisfied, production assets are securely replicated and regularly backed up to multiple geographic regions.\nWe monitor our production infrastructure to ensure high performance and availability, and our architecture allows our operators significant flexibility in achieving these goals. In particular, we have fine-grained control over the specific server and region on which each customer's data resides, and can move customer data between different geographic regions in order to avoid service disruption or to increase service performance.\nSensitive customer data, including passwords, Social Security, and tax identification numbers, is encrypted during transmission, and before being written to disk. We regularly evaluate our product and infrastructure security, including through third-party penetration testing. In addition, our products allow our customers to define roles that provide different levels of access to users, allowing them to view and modify specific items depending on their role. Supervisors can distribute work to on-site staff in a secure and controlled environment, while leadership retains visibility across the entire system. Some sensitive customer actions require secondary verification via two-factor authentication, and any customer can enable two-factor authentication for logging into their account.\nResearch and Product Development\nWe rely heavily on input from our customers and prospective customers in developing products that meet their needs and in anticipating developments in their businesses. We perform research and market validation efforts to guide our product roadmap. We believe that it is easier for our customers to adjust to continuous updates to our platform, which incrementally change and improve their user experience than to adapt to infrequent, but more drastic, upgrades.\nCompetition\nThe overall market for business management solutions in the real estate and other industries is global, highly competitive and continually evolving to respond to changes in technology, operational requirements, and ever-changing laws and regulations. We believe our competitors primarily fall into the following categories:\n• On-premise or cloud-based real estate business management service providers that serve companies of all sizes in our markets; and\n• On-premise or cloud-based horizontal business management service providers that offer broad solutions across multiple industries.\nWe also experience competition from numerous cloud-based solutions providers that focus almost exclusively on one or more point solutions in the real estate industry or in other industries. Continued consolidation among cloud-based solution providers could significantly increase competition.\nSome of our competitors may have greater financial, technical and other resources, greater name recognition and larger sales and marketing budgets; therefore, we may not always compare favorably with respect to some or all of the foregoing factors. Further, the barrier to entry for competition in one or more areas we serve may be low, which could lead to competition from new entrants who solve similar problems in different ways.\nIntellectual Property\nWe rely on a combination of patents, copyrights, trademarks, trade secrets, confidentiality procedures and contractual restrictions to establish and protect our proprietary rights in our core solutions and Value Added Services. We may pursue additional patent protection to the extent we believe it would be beneficial and cost-effective.\nWe control access to our proprietary technology by entering into confidentiality and invention assignment agreements with our employees and contractors, and confidentiality agreements with third parties. Despite our precautions, it may be possible for unauthorized third parties to copy our products and use information that we regard as proprietary to create products and services that compete with ours.\nHuman Capital\nWe believe our people are at the heart of our success. Our employees’ dedication to and passion for creating and delivering transformative solutions provides us with a competitive advantage and creates long-lasting relationships with our customers. We believe our efforts in creating and maintaining strong connections - with our customers, partners, and team members - differentiates AppFolio as a great place to work. This has led to recognition that demonstrates our valued company culture and workplace: Fortune recognized AppFolio as a Great Place to Work for Women in 2021, and the annual Glassdoor Employees’ Choice Awards listed AppFolio as one of the Best Places to Work in 2022.\nOur company culture, driven by the following six core values, fuels our dedication and passion:\n•Simpler Is Better\n•Great, Innovative Products Are Key To A Great Business\n•Great People Make A Great Company\n•Listening To Customers Is In Our DNA\n•Small, Focused Teams Keep Us Agile\n•We Do The Right Thing; It’s Good For Business\nAs of December 31, 2021, we had 1,600 employees. We routinely engage temporary employees and consultants. None of our employees are represented by a labor union or covered by a collective bargaining agreement. We consider our relationships with our employees and consultants to be strong. To maintain this strong relationship and attract new talent, our human capital management efforts focus on the following initiatives:\nDiversity, Equity, and Inclusion. Diversity is core to our values and, we believe, necessary to drive innovation and collective growth. Our commitment to these imperatives starts at the leadership level and cascades to our talented employees, who we look to lead and foster various initiatives. AppFolio’s employee-led resource groups create an environment where everyone is valued for their uniqueness, while also feeling part of the larger whole. We work hard to make sure our employees’ voices are heard, from our practice of small, focused teams to setting annual company initiatives together as an organization.\nWhen we surveyed our workforce in 2021, of those who elected to share, 45.1% identified as women, 54.1% as men, and 0.8% as nonbinary.\nOur recruiting practices focus on attracting and hiring employees with diverse backgrounds, experiences, and approaches at all levels of the company. We have key partnerships with universities and professional organizations and provide ongoing education to our hiring teams that are focused on closing the diversity gap and growing our team.\nEmployee Development. We invest significant resources to develop the talent needed to remain at the forefront of innovation and make us an employer of choice. Employees throughout our organization have access to training and learning programs which include programs for distinct audiences. Our annual engagement survey provides a platform for employees to provide anonymous feedback directly to their managers and our executives. Based on results from our 2021 engagement survey, the overall engagement of employees is greater than the technology industry average.\nSocietal Impact. Connecting and contributing to our communities is a long-standing tradition and important activity for our employees. Our team members are passionate about many causes and we encourage them to participate in these causes by providing eight hours of volunteer time off annually. In addition, throughout the year, we come together as a company to engage in community service through “AppFolio Gives Back,” where we donate time and funds to several charities that are selected by our employee-led Give Back Committee with AppFolio matching donations.\nCompensation and Benefits. Our compensation and benefits programs support the wellness of our employees and their families so they feel they can live their best lives both at work and at home. Our competitive compensation packages may include base salary, commission or annual performance-based bonuses, and stock-based compensation. We also offer family-forming benefits, paid parental leave, paid sabbaticals, paid leave to care for family members, and access to fertility networks and discounts on fertility care. We review our programs periodically to ensure they remain competitive.\nHealth, Safety, and Wellness. We are committed to providing a safe workplace for our employees and assisting them in maintaining a healthy work-life balance. We regularly solicit feedback to assess the well-being and needs of our employees and offer resources focused on mental health and physical wellness. Specific to the COVID-19 pandemic, we have also taken measures to support the health and safety of our employees and their families. We continue to provide a monthly stipend to our employees in an effort to help ensure each team member has a comfortable and functional work-from-home environment and we have added training and toolkits focused on helping employees be successful in a remote work environment. We have enhanced internal lifestyle programs, such as virtual group fitness classes, and increased supplemental time off to create additional space for employees to reset and recharge.\nIn July 2021, we began transitioning our employees back to the workplace on a voluntary basis. When the environment allows us to safely do so, we expect to move forward with a hybrid work model, where a majority of our employees work out of one of our offices several days a week. We continue to evolve and upgrade our physical locations to ensure safe and healthy workspaces for our team members.\nAvailable Information\nCopies of the reports, proxy statements and other information may also be obtained, free of charge, electronically through our corporate website, at www.appfolioinc.com, as soon as reasonably practical after we file such material with, or furnish it to, the SEC.",
    "item_1A": "ITEM 1A. RISK FACTORS\nYou should consider carefully the risks described below, together with all of the other information included in this Annual Report, as well as in our other filings with the SEC, in evaluating our business and/or an investment in our Class A common stock. If any of the following risks actually occur, our business, financial condition, operating results and future prospects could be materially and adversely affected. In that case, the trading price of our Class A common stock may decline and you might lose all or part of your investment. The risks described below are not the only ones we face. Additional risks that we currently do not know about or that we currently believe to be immaterial may also impair our business, financial condition, operating results and prospects.\nPlease be advised that certain of the risks and uncertainties described below contain “forward-looking statements.” See the section of this Annual Report entitled “Forward-Looking Statements” for additional information.\nRisks Related to Growing Our Business\nIf we do not accurately predict and respond promptly to rapidly evolving technological developments and customer needs, the demand for our products and our business and operating results may be harmed.\nCustomer demands are constantly changing in response to new technology and other market factors. To compete effectively, we must identify and innovate in the right technologies, accurately predict our customers’ evolving needs, and continually improve our own technology platform. If we fail to execute against any of the foregoing, our business and operating results may be harmed. In addition, the potential widespread adoption of quickly evolving disruptive technology products could significantly impact the real estate industry, even if such products are not specifically designed to apply directly to the real estate industry. The adoption of these new technologies could significantly reduce the volume or demand of our customers and users, thereby reducing our revenue, which could materially impact our business, financial condition and operating results.\nWe participate in an intensely competitive market and our business could be harmed if we do not compete effectively.\nThe market for cloud-based business management solutions is global, highly competitive and continually evolving in response to a number of factors, including changes in technology, operational requirements, and laws and regulations. We compete with both other real estate industry cloud-based solution providers and providers of broad cloud-based solutions across multiple industries. We also face competition from numerous cloud-based solution providers that focus almost exclusively on one or more point solutions. Our competitors include established vendors, as well as newer entrants in the market. Our established competitors may have greater name recognition, longer operating histories, and significantly greater resources, which allows them to respond more quickly and effectively to new or changing opportunities or challenges, technologies, operational requirements and industry standards. Our competitors who are new entrants to the market, and generally smaller, may have more nimble operations due to having fewer products and less overhead and may be willing to take legal and operational risks, which allows them to launch products and meet customer demand more quickly and efficiently. Regardless of size, our current and potential competitors may develop, market and sell new technologies with comparable functionality to our solutions, which could cause us to lose customers, slow the rate of growth of new customers and/or cause us to decrease our prices to remain competitive, which could harm our business.\nIf we are unable to successfully expand sales of our solutions to new markets and new industries, our business and operating results may suffer.\nOur growth strategy includes expanding sales of our solutions to new markets and, potentially, new industries. These new markets and industries, include larger customers within the real estate space, housing types outside of multi-family and single-family residential, and industries other than real estate. Acceptance of our current and future solutions in new markets and industries will depend on numerous factors, including our ability to provide more sophisticated functionality and features, the pricing of our solutions relative to competitive products, perceptions about the security, privacy and availability of our solutions relative to competitive products, and the time-to-market of updates and enhancements to our services and products. There is no guarantee we will be successful in achieving all or any of the foregoing. Additionally, sales to new markets and industries will involve risks that are not present, or are present to a lesser extent, in sales to the markets and industry we currently serve, and such risks may include new regulatory regimes, longer sale cycles, increased chance of litigation with customers, increased risk and impact of reputational harm, and increased competition. We may not be able to sufficiently mitigate such risks, which would impact our ability to successfully expand our business. If we are unable to successfully expand sales of our solutions to new markets and, potentially, industries, our revenue may increase at a slower rate than we expect and may even decline, which could adversely affect our operating results.\nOur business depends substantially on existing customers renewing their subscriptions with us and expanding their use of our Value Added Services, and a decline in either could adversely affect our operating results.\nFor us to maintain or increase our revenue and improve our operating results, it is important that our existing customers continue to use our core solutions, as well as increase their adoption and utilization of our Value Added Services. Our customers may not renew their subscriptions with us, continue to broaden their adoption and utilization of our Value Added Services, or use our Value Added Services at all. If our existing customers do not renew their subscriptions and increase their adoption and utilization of our existing or newly developed Value Added Services, our revenue may increase at a slower rate than we expect and may decline, which could adversely affect our financial condition and operating results. A reduction in the number of our existing customers, even if offset by an increase in new customers, could reduce our revenue and operating margins. We may need to employ increasingly costly sales and marketing efforts and make significant investments in research and product development to introduce Value Added Services that ultimately are not broadly adopted by our customers. In either of those cases, we could incur significantly increased costs without a corresponding increase in revenue. Furthermore, we may fail to identify Value Added Services that our customers need for their businesses, in which case we could miss opportunities to increase our revenue.\nOur inability to effectively maintain and promote our brands could adversely affect our ability to attract new customers and negatively affect our business and operating results.\nWe believe that maintaining and promoting our brands is critical to achieving widespread awareness and acceptance of our solutions, and maintaining and expanding our customer base. We also believe that the importance of brand recognition will increase, as competition for our products and services increases. If we do not continue to build awareness of our brands, we could be placed at a competitive disadvantage compared to companies whose brands are, or become, more recognizable than ours. Maintaining and promoting our brands will depend, in part, on our ability to continue to provide new and innovative core functionality and Value Added Services and best-in-class customer service, as well as the effectiveness of our sales and marketing efforts. If we fail to deliver products and functionality that address our customers’ business needs, or if we fail to meet our customers’ expectations for customer service, it could weaken our brands and harm our reputation. Maintaining and enhancing our brands may require us to make substantial investments, and these investments may not result in commensurate increases in our revenue. If we fail to successfully maintain and promote our brands, or if we make investments that are not offset by increased revenue, our operating results could be adversely affected.\nWe manage our business to achieve long-term growth, which may not be consistent with the short-term expectations of some investors.\nWe make product decisions and pursue opportunities that are consistent with our strategic objective to achieve long-term growth. These decisions may not be consistent with the short-term expectations of some investors, and may cause significant fluctuations in our results of operation and our stock price from period to period. In addition, notwithstanding our intention to make strategic decisions that positively impact long-term value, the decisions we make may not produce the long-term benefits we expect, which could materially affect our business, financial condition and results of operation.\nOur acquisition of other companies or technologies may subject us to risks.\nWe have acquired, and may in the future acquire, other companies or technologies to complement or expand our products and solutions, optimize our technical capabilities, enhance our ability to compete, or otherwise offer growth or strategic opportunities. We have limited experience acquiring other businesses and we may not be able to effectively integrate acquired assets, technologies, personnel and operations or achieve the anticipated synergies or other benefits from the acquired business due to the inherent risks associated with acquisitions. If an acquisition fails to meet our expectations in terms of its contribution to our overall business strategy or results of operation, or if the costs of acquiring or integrating the acquired business exceed our estimates, our business, results of operation, strategic objectives, and financial condition may suffer.\nRisks Related to Attracting and Retaining Talent\nWe depend on highly skilled personnel and, if we are unable to retain or hire additional qualified personnel or if we lose key members of our management team, we may not be able to achieve our strategic objectives and our business may be harmed.\nOur success and future growth depend, in part, upon the continued services of our executive officers and other key employees. To execute our growth plan and achieve our strategic objectives, we must continue to attract and retain highly qualified and motivated personnel across our organization. In particular, to continue to enhance our products and solutions, add new and innovative core functionality and/or Value Added Services, as well as develop new products, it will be critical for us to increase the size of our research and product development organization, including hiring highly skilled software engineers. Further, for us to achieve broader market acceptance of our products and solutions, grow our customer base, and pursue new markets consistent with our strategic plan, we will need to continue to increase the size of our sales, marketing and customer service and support organizations. Competition for personnel is intense within our industry and there continues to be upward pressure on the compensation paid to these professionals. Identifying, recruiting, training and retaining qualified personnel is difficult and requires a significant investment of time and resources.\nMany of the companies with which we compete for experienced personnel have greater name recognition and financial resources than we have. In addition, our headquarters are located in Santa Barbara, California, which is not generally recognized as a prominent commercial center, and it is challenging to attract qualified professionals due to our geographic location. As a result, we may have even greater difficulty hiring and retaining skilled personnel than our competitors. In addition, prospective and existing employees often consider the value of the equity awards they receive in connection with their employment. If the perceived value of our equity awards declines, we are unable to offer equity awards in competitive amounts, or if the price of our Class A common stock experiences significant volatility, this may adversely affect our ability to recruit and retain highly skilled employees. If we are unable to attract and retain the personnel necessary to execute our growth plan, we may be unable to achieve our strategic objectives and our operating results may suffer.\nOur corporate culture has contributed to our success and, if we cannot continue to foster this culture, we could lose the passion, creativity, teamwork, focus and innovation fostered by our culture.\nWe believe that our culture has been and will continue to be a key contributor to our success. If we do not continue to develop our corporate culture or maintain our core values as we grow and evolve, we may be unable to foster the passion, creativity, teamwork, focus and innovation we believe we need to support our growth. Any failure to preserve our culture could negatively affect our ability to recruit and retain personnel and to effectively focus on and pursue our strategic objectives. Moreover, liquidity available to our employee security holders could lead to disparities of wealth among our employees, which could adversely impact relations among employees and our culture in general. As we grow, we may find it difficult to maintain our corporate culture. This difficulty may be exacerbated by remote working conditions, which make it more difficult for employees to interact, communicate and innovate and that may continue indefinitely after COVID-19 pandemic.\nRisks Related to Cybersecurity and Data Privacy\nSecurity vulnerabilities in our products or a breach of our security controls could result in the loss, theft, misuse, unauthorized disclosure, or unauthorized access to customer or employee data, or other confidential or sensitive information, which could harm our customer and/or employee relationships, expose us to litigation or harm our reputation.\nOur business involves the storage and transmission of a significant amount of confidential and sensitive information, including sensitive and proprietary data and personal information collected by or on behalf of our customers, the personal information of our employees, and our proprietary financial, operational and strategic information. Like many other businesses, we have experienced, and are continually at risk of being subject to, cyber attacks and data security incidents. As our business grows, the number of users of our products, as well as the amount of information we collect and store, is increasing, and our brands are becoming more widely recognized, which makes us a greater target for malicious activity. There can be no assurance that the security measures we employ will prevent malicious or unauthorized access to our systems and information. Furthermore, no security program can entirely eliminate the risk of human error, such as an employee or contractor’s failure to follow one or more security protocols. Therefore, despite our significant efforts to keep our systems, products and networks protected and up to date, we may be unable to anticipate cyber attacks, detect security incidents or react to them in a timely manner, or implement adequate preventive measures, any of which may expose us to a risk of loss, litigation and potential liability. In addition, some of our third-party service providers and partners also collect and/or store our sensitive information and our customers’ data on our behalf, and these service providers and partners are subject to similar threats of cyber attacks and other malicious Internet-based activities, which could also expose us to risk of loss, litigation, and potential liability.\nIf our security measures, or the security measures of our third-party service providers or partners, are breached as a result of wrongdoing or malicious activity on the part of our employees, our partners’ employees, our customers’ employees, or any third party, or as a result of any human error or neglect, product defect or otherwise, and this results in the loss, theft, misuse, unauthorized disclosure, or unauthorized access to customer data or other sensitive information, we could incur liability to our customers and to individuals or organizations whose information was being stored by us or our customers, as well as fines from payment processing networks and regulatory action by governmental bodies. If we experience a widespread security breach, our insurance coverage may not offset liabilities actually incurred and insurance may not continue to be available to us on reasonable terms, or at all. In addition, security breaches could result in reputational damage, adversely affect our ability to attract new customers and cause existing customers to reduce or discontinue the use of our products and solutions. Furthermore, the perception by our current or potential customers that our products could be vulnerable to exploitation or that our security measures are inadequate, even in the absence of a particular problem or threat, could reduce market acceptance of our products and solutions and cause us to lose customers. The legal and regulatory environment around data security and governance is significantly evolving, and both regulators and consumers are increasingly taking action on data-related matters, which may contribute to increased reputational, economic and other harm in the event of a data security incident.\nPrivacy and data security laws and regulations could impose additional costs and reduce demand for our solutions.\nWe store and transmit personal information relating to our employees and other individuals, and our customers use our technology platform to store and transmit a significant amount of personal information relating to their customers, vendors, employees and other industry participants. Federal, state and foreign government bodies and agencies have in the past adopted, and may in the future adopt, laws and regulations regarding the collection, use, processing, storage and disclosure of personal or identifying information obtained from customers and other individuals. These new obligations could increase the cost and complexity of delivering our services.\nIn addition to government regulation, privacy advocates and industry groups may propose various self-regulatory standards that may legally or contractually apply to our business. As new laws, regulations and industry standards take effect, and as we offer new services in new markets, market segments and, potentially, new industries, we will need to understand and comply with various new requirements, which may result in significant additional costs. These laws, regulations and industry standards could have negative effects on our business, including by increasing our costs and operating expenses, and/or delaying or impeding our deployment of new or existing core functionality or Value Added Services. Failure to comply with these laws, regulations and industry standards could result in negative publicity, subject us to fines or penalties, expose us to litigation, or result in demands that we modify or cease existing business practices. In addition, the costs of compliance with, and other burdens imposed by, such laws, regulations and industry standards may adversely affect our customers’ ability or desire to collect, use, process and store personal information using our solutions, which could reduce overall demand for them. Furthermore, privacy and data security concerns may cause our customers’ clients, vendors, employees and other industry participants to resist providing the personal information necessary to allow our customers to use our applications effectively. Any of these outcomes could adversely affect our business and operating results.\nRisks Related to Our Industry\nAll of our revenues are presently generated by sales to customers and users in the real estate industry, and factors that adversely affect that industry, or our customers or users within it, could also adversely affect us.\nWe expect that our real estate industry customers will continue to account for a significant portion or all of our revenue for the foreseeable future. Demand for our solutions and services could be affected by factors that are unique to and adversely affect the real estate industry and our customers within it. If the industry itself declines, our customers may decide not to renew their subscriptions or they may cease using our Value Added Services to reduce costs to remain competitive. Further, we could lose real estate customers as a result of acquisitions or consolidations, bankruptcies or other financial difficulties facing our real estate customers, new or enhanced legal or regulatory regimes that negatively impact the real estate industry, and conditions or trends specific to the real estate industry such as the economic factors that impact the rental market.\nOur estimates of market opportunity are subject to significant uncertainty and, even if the markets in which we compete meet or exceed our size estimates, we could fail to increase our revenue or market share.\nWe determine the level of our investment in various aspects of the business, in part, based on our market opportunity estimates. Market opportunity estimates are subject to significant uncertainty and are based on assumptions, including our internal analysis and industry experience. Assessing markets for cloud-based business management solutions in the real estate industry is particularly difficult due to a number of factors, including limited available information and rapid evolution of the industry and markets therein. If we do not accurately estimate our opportunities, we may fail to realize a return on our investment in various aspects of our business, which could lead to a failure to gain market share and negatively impact our long-term growth prospects.\nRisks Related to Our Products and Solutions\nErrors, defects or other disruptions in our products could harm our reputation, cause us to lose customers, and result in significant expenditures to correct the problem.\nOur customers use our products to manage critical aspects of their businesses, and any errors, defects or other disruptions in the performance of our products, including with respect to third party partners upon which certain of our products are dependent, may result in loss of or damage to our customers’ data and disruption to our customers’ businesses, which could harm our reputation. These problems may be caused by a variety of factors, including infrastructure changes, power or network outages, fire, flood or other natural disasters affecting our cloud computing platform providers, human or software errors, viruses, security breaches, fraud or other malicious activity, spikes in customer usage and distributed denial of service attacks. In addition, we provide continuous updates to our products and these updates may contain undetected errors when first introduced. In the past, we have discovered errors, failures, vulnerabilities and bugs in our updates after they have been released, and similar problems may arise in the future. Real or perceived errors, failures, vulnerabilities or bugs in our products could result in negative publicity, reputational harm, loss of customers, delay in market acceptance of our products and solutions, loss of competitive position, withholding or delay of payment to us, claims by customers for losses sustained by them and potential litigation or regulatory action. In any such event, we may be required to expend additional resources to help correct the problem or we may choose to expend additional resources to take corrective action even where not required. The costs incurred in correcting any material errors, defects or other disruptions could be substantial. In addition, we may not carry insurance sufficient to offset any losses that may result from claims arising from errors, defects or other disruptions in our products.\nWe face risks in our electronic payment services business that could adversely affect our business and/or results of operation.\nIn our electronic payments services business, we facilitate the processing of both inbound and outbound payments for our customers. These payments are settled through our sponsoring clearing bank, card payment processors, and other third-party electronic payment services providers that we may contract with from time to time. Our electronic payment services subject us to a number of risks, including, but not limited to, liability for customer costs related to disputed or fraudulent transactions and other incidences of fraud in our electronic payment services ecosystem. Additionally, with respect to the processing of electronic payment transactions by our third-party electronic payment services providers, we are exposed to financial risk. Electronic payment transactions between our customer and another user may be returned for various reasons such as insufficient funds, fraud or stop payment orders. If we or any of our electronic payment services providers are unable to collect such amounts from the customer’s account, we bear the ultimate risk of loss for the transaction amount.\nWe face risks in our tenant screening services business that could adversely affect our business and/or operating results.\nOur tenant screening services business is subject to a number of complex laws that are subject to varying interpretations, including the Fair Credit Reporting Act (the \"FCRA\"), the Fair Housing Act, and related regulations. The FCRA continues to be the subject of multiple class-based litigation proceedings, as well as numerous regulatory inquiries and enforcement actions. In addition, entities such as the Federal Trade Commission and the Consumer Financial Protection Bureau have the authority to promulgate rules and regulations that may impact our customers and our business and have made various public statements that tenant screening is an area of focus for such agencies. Although we attempt to structure our tenant screening services to comply with relevant laws and regulations, we have previously been accused of not complying with such laws and regulations and may be found to be in violation of them. In addition we have been and expect in the future to be subject to routine regulatory inquiries, enforcement actions, class-based litigation and/or indemnity demands.\nAs previously disclosed, in January 2021, we entered into a settlement agreement with the Federal Trade Commission (the \"FTC\") to resolve allegations that we failed to comply with certain sections of the FCRA. In connection with the settlement, we paid a fine and agreed to ongoing compliance and reporting obligations. Our failure to comply with these obligations could result in material additional penalties or other actions by the FTC or other agencies, including enjoining our ability to provide screening services.\nDue to the large number of tenant screening transactions in which we participate, our potential liability in any enforcement action or a class action lawsuit could have a material impact on our business, especially given that certain applicable laws and regulations provide for fines or penalties on a per occurrence basis. The existence of any such enforcement action or class action lawsuit, whether meritorious or not, may adversely affect our ability to attract customers, result in the loss of existing customers, harm our reputation and cause us to incur defense costs or other expenses.\nIf our property management customers stop requiring insurance coverage for their units, if insurance premiums decline or if insureds experience greater than expected losses, our operating results could be harmed.\nWe generate a portion of our revenue by offering insurance-related services through wholly owned subsidiaries. If demand for rental housing declines, or if our property management customers believe that it may decline, these customers may stop requiring insurance coverage for their units to reduce the overall cost of renting and make their rental offerings more competitive. If our property management customers stop tracking and requiring insurance coverage for their units or elect to use other methods of tracking and acquiring insurance coverage, demand for our insurance-related products may drop and our revenues from our insurance related products could be adversely affected.\nIn the event we are found to be in violation of the legal requirements applicable to our products and services, our business and operating results may be adversely affected.\nMany of our products and services are highly regulated or intended to be used in connection with other highly regulated activities. Some of the laws and regulations to which our products and services are subject include, without limitation:\n•the Fair Housing Act;\n•the FCRA;\n•Title VII of the Civil Rights Act;\n•the Telephone Consumer Protection Act;\n•the Americans with Disabilities Act;\n•the Electronic Signatures in Global and National Commerce Act;\n•the Federal Trade Commission Act Section 5; and\n•the Federal Trade Commission Act;\nState law equivalents of the foregoing, plus various state regulations related to insurance licensing and solicitation, utility billing practices and privacy also apply to certain of our products and services. In addition, the evolution and expansion of our products and services may subject us to additional risks and regulatory requirements. For example, as our electronic payments services business evolves, we may become directly subject to limitations, laws and regulations governing money transmission and anti-money laundering.\nIn addition, we periodically undergo examinations, audits and investigations related to our services, including those related to the affairs of insurance companies and agencies and electronic payment services providers. Such examining, auditing, and investigating authorities are generally vested with relatively broad discretion to grant, renew and revoke licenses and approvals, to implement and interpret rules and regulations, levy fines and penalties, and bring enforcement actions. While we have implemented various programs, processes and controls focused on compliance with applicable laws and regulations throughout our business, there is no guarantee that we will not be subject to fines, penalties or other regulatory actions in one or more jurisdictions, or be required to adjust our business practices to accommodate future regulatory requirements. In the event that we are found to be in violation of our legal, regulatory or contractual requirements, we may be subject to monetary fines or penalties, cease-and-desist orders, mandatory product changes, or other liabilities that could have an adverse effect on our business and operating results.\nIf we fail to maintain relationships with third-party partners that enable certain functionality within our solutions, our business and operating results may be harmed.\nCertain functionality of our services is provided or supported by third-parties, including without limitation functions related to cloud computing, texting, emailing, electronic payments, tenant screening, and insurance related offerings. If our third-party partners cease providing their products or we are otherwise unable to integrate with such third-party products, our solutions and demand for our solutions could be adversely impacted and business and operating results would be harmed. In addition, our competitors may be more effective than us in cost-effectively building relationships with third parties that enhance their products and services, allow them to provide more competitive pricing, or offer other benefits to their customers. Acquisitions of our partners by our competitors or others could result in a decrease in the number of current and potential strategic partners willing to establish or maintain relationships with us, and could increase the price at which products or services are available to us. If we are unsuccessful in establishing or maintaining our relationships with third parties, our ability to compete in the marketplace or to grow our revenue could be impaired, which could negatively impact our operating results.\nIf we are unable to ensure that our solutions interoperate with third-party devices, operating systems and browsers, our solutions may become less competitive and our operating results may be harmed.\nWe depend on the interoperability of our platform with third party devices, desktop and mobile operating systems, as well as web browsers that we do not control. Any changes in such devices, systems or web browsers that degrade the functionality of our solutions or give preferential treatment to competitive services could adversely affect the adoption and usage of our solutions. In addition, to deliver high quality solutions, we will need to continuously enhance and modify our functionality to keep pace with technical, contractual, and other changes in Internet-related hardware, mobile operating systems such as iOS and Android, browsers, communication, network and database technologies. We may not be successful in developing enhancements and modifications that operate effectively with these devices, operating systems, web browsers and other technologies or in bringing them to market in a timely manner. Furthermore, uncertainties regarding the timing or nature of new network platforms or technologies, and modifications to existing platforms or technologies, could increase our research and product development expenses. In the event that it is difficult for our customers to access and use our solutions, our solutions may become less competitive, and our operating results could be adversely affected.\nIf we are unable to deliver effective customer service, it could harm our relationships with our existing customers and adversely affect our ability to attract new customers and our operating results.\nOur business depends, in part, on our ability to satisfy our customers by providing onboarding services and ongoing customer service. Once our solutions are deployed, our customers depend on our customer service organization to resolve technical issues relating to their use of our solutions. As we generally do not separately charge our customers for support services, increased demand for our support services would increase costs without corresponding revenue, which could adversely affect our operating results. Further, our sales process is highly dependent on the ease of use of our solutions, our reputation and positive recommendations from our existing customers. Any failure to maintain high-quality or responsive customer service, or a market perception that we do not maintain high-quality or responsive customer service, could harm our reputation, cause us to lose customers and adversely impact our ability to sell our solutions to prospective customers.\nRisks Related to Intellectual Property Matters\nFailure to protect our intellectual property rights could impair our ability to protect our proprietary technology and our brands, which could harm our business.\nWe currently rely on patent, trademark, copyright and trade secret laws, trade secret protection and confidentiality or license agreements with our employees, customers, partners and others to protect our intellectual property rights. Our success and ability to compete depend, in part, on our ability to continue to protect our intellectual property, including our proprietary\ntechnology and our brands. If we are unable to protect our proprietary rights adequately, our competitors could use the intellectual property we have developed to enhance their own products and services, which could harm our business. To monitor and protect our intellectual property rights, we may be required to expend significant resources. Litigation brought to protect and enforce our intellectual property rights could be costly, time-consuming and distracting to management, and could result in the impairment or loss of portions of our intellectual property or require us to pay costly royalties. Accordingly, we may not be able to prevent third parties from infringing upon or misappropriating our intellectual property. Our failure to secure, protect and enforce our intellectual property rights could adversely affect our business and operating results.\nWe may be sued by third parties for alleged infringement of their proprietary rights, which could cause us to incur significant expenses and require us to pay substantial damages.\nOur success depends, in part, on our not infringing upon the intellectual property rights of others. Our competitors, as well as a number of other entities and individuals, may legally own or claim to own intellectual property relating to our technology or solutions, including without limitation technology we develop and build internally and/or acquire. From time to time, our competitors or other third parties may claim that we are infringing upon their intellectual property rights. Any claims or litigation, regardless of merit, could cause us to incur significant expenses and, if successfully asserted against us, could require that we pay substantial damages, settlement costs or ongoing royalty payments, require that we comply with other unfavorable license and other terms, or prevent us from offering our solutions in their current form. Even if the claims do not result in litigation or are resolved in our favor, these claims, and the time and resources necessary to resolve them, could divert the attention of our management and key personnel from our business operations and harm our operating results.\nOur solutions contain both third-party and open source software, which may pose risks to our proprietary source code and/or introduce security vulnerabilities, and could have a material adverse impact on our business and operating results.\nWe use open source software in our solutions and expect to continue to do so in the future. The terms of many open source licenses to which we are subject have not been interpreted by United States or foreign courts, and there is a risk that open source licenses could be construed in a manner that imposes unanticipated conditions, restrictions or costs on our ability to provide or distribute our solutions. Additionally, we may from time to time face claims from third parties alleging ownership of, or demanding release of, the open source software or of derivative works that we developed using such software, which could include our proprietary source code, or otherwise seeking to enforce the terms of the applicable open source license. These claims could result in litigation, which could be costly for us to defend, and could require us to make our source code freely available, purchase a costly license or cease offering the implicated functionality unless and until we can re-engineer them to avoid infringement. This re-engineering process could require significant additional research and product development resources, and we may not be able to complete it successfully or in a timely manner. In addition to risks related to license requirements, usage of certain open source software can lead to greater risks than use of third-party commercial software, as open source licensors generally do not provide warranties or controls on the origin of software. We also use third-party commercial software in our solutions and expect to continue to do so in the future. Third-party commercial software is developed outside of our direct control and may introduce security vulnerabilities that may be difficult to anticipate or mitigate. Further, there is no guarantee that third-party software developers or open source software providers will continue active work on the third-party software that we use. Should development of in-use third-party software cease, significant engineering effort may be required to create an in-house solution. These risks could also be difficult to eliminate or manage, and could have a material adverse impact on our business and operating results.\nRisks Related to Our Financial Results\nWe expect to make substantial investments across our organization to grow our business, which may impact profitability.\nTo implement our business and growth strategy, we have made and will continue to make substantial investments across our organization and, as a result, our expenses may increase significantly impacting profitability. For example, we intend to continue to make substantial investments in, among other things: our research and product development organization to enhance the ease of use and functionality of our solutions and develop new products; our sales and marketing organization, including expansion of our direct sales organization and marketing programs, to increase the size of our customer base and increase adoption and utilization of new and existing Value Added Services by our new and existing customers; and maintaining and expanding our technology infrastructure and operational support to promote the security and availability of our products and solutions. Even if we are successful in growing our customer base and increasing revenue from new and existing customers, we may not be able to generate additional revenue in an amount that is sufficient to cover our expenses.\nOur quarterly results may fluctuate significantly and period-to-period comparisons of our results may not be meaningful.\nOur quarterly results, including the levels of our revenue, costs, operating expenses, and operating margins, may fluctuate significantly in the future, and period-to-period comparisons of our results may not be meaningful. Accordingly, the results of any one quarter should not be relied upon as an indication of our future performance. We may experience significant fluctuations in our operating results from period to period, including significant losses. This may make it difficult for us to effectively allocate our resources to achieve our strategic goals. Furthermore, if our quarterly results fall below the expectations of investors or any securities analysts who follow our stock, or below any financial guidance we may provide, the price of our common stock could decline substantially.\nThere are risks associated with potential future indebtedness that may adversely affect our financial condition and future financing agreements may contain restrictive operating and financial covenants.\nWe may incur additional indebtedness in the future and/or enter into new financing arrangements. Our ability to meet expenses, to remain in compliance with the covenants under any future debt instruments, and to pay fees, interest and principal on our indebtedness will depend on, among other things, our operating performance and market conditions. Accordingly, our cash flow may not be sufficient to allow us to pay principal and interest on future indebtedness and meet our other business and customer obligations.\nOur ability to use our net operating loss carryforwards and certain other tax attributes may be limited.\nUnder Section 382 of the Internal Revenue Code of 1986, as amended, if a corporation undergoes an “ownership change,” the corporation’s ability to use its pre-change net operating loss carryforwards and other pre-change tax attributes, such as research tax credits, to offset its post-change income and taxes may be limited. In general, an “ownership change” occurs if there is a cumulative change in our ownership by “5% shareholders” that exceeds 50% over a rolling three-year period. Similar rules may apply under state tax laws. It is possible that our existing net operating loss and/or credit carryforwards may be subject to limitations arising from previous ownership changes, and future issuances of our stock could cause an ownership change. Furthermore, our ability to utilize net operating loss and/or credit carryforwards of companies that we have acquired or may acquire in the future may be subject to limitations. There is also a risk that due to legislative changes, such as suspensions on the use of net operating loss carryforwards, or other unforeseen reasons, our existing net operating loss carryforwards could expire or otherwise be unavailable to offset future income tax liabilities.\nRisks Related to Our Common Stock\nThe market price of our Class A common stock may be volatile or may decline regardless of our operating performance, which could result in substantial losses for our stockholders.\nThe market price of our Class A common stock has been, and is likely to continue to be, highly volatile, and fluctuations in the price of our Class A common stock could cause the stockholder to lose all or part of their investment. There are a wide variety of factors, many of which are outside our control, that could cause fluctuations in the market price of our Class A common stock and, in the past, following periods of volatility in the overall market and the market price of a particular company’s securities, securities class action litigation has often been instituted against these companies. If instituted against us, any such litigation, regardless of its merit or final outcome, could result in substantial costs and a diversion of our management’s attention, thereby adversely affecting our operating results and/or the price of our Class A common stock.\nThe dual class structure of our common stock concentrates voting control with a limited number of stockholders, including our executive officers, directors and principal stockholders, effectively limiting your ability to influence corporate matters.\nOur Class B common stock has 10 votes per share, and our Class A common stock has one vote per share. As of December 31, 2021, the holders of the outstanding shares of our Class B common stock, including our executive officers, directors, and principal stockholders, collectively held approximately 89% of the combined voting power of our outstanding capital stock. Because of the 10-to-1 voting ratio between our Class B common stock and Class A common stock, the holders of our Class B common stock collectively control a majority of the combined voting power of our outstanding capital stock and therefore control the election of a majority of our directors and thereby have the power to control our affairs and policies, including the appointment of management and strategic decisions, as well as matters that are submitted to a vote by our holders of our common stock. The interests of our principal stockholders may be inconsistent with or adverse to those of holders of our Class A common stock. This concentrated control may also have the effect of delaying, deterring or preventing a change-in-control transaction, depriving our stockholders of an opportunity to receive a premium for their capital stock or negatively affecting the market price of our Class A common stock. In addition, transfers by holders of our Class B common stock will generally result in those shares converting to Class A common stock, subject to limited exceptions. The conversion of our Class B common stock to Class A common stock will have the effect, over time, of increasing the relative voting power of the holders of our Class B common stock who retain their shares over the long term.\nWe cannot predict the impact that our capital structure may have on our stock price.\nS&P Dow Jones, a provider of widely followed stock indices, has announced that companies with multiple classes of stock will not be eligible for inclusion in certain of their indices. As a result, our Class A common stock will not be eligible for those stock indices. Many investment funds are precluded from investing in companies that are not included in major indices, and these funds would be unable to purchase our Class A common stock. Exclusion from these and other indices could make our Class A common stock less attractive to investors and, as a result, the market price of our Class A common stock could be adversely affected. In addition, several shareholder advisory firms have announced their opposition to the use of multiple class structures. As a result, shareholder advisory firms may publish negative commentary about our corporate governance practices or otherwise seek to cause us to change our capital structure. Any actions or publications by shareholder advisory firms critical of our corporate governance practices or capital structure could also adversely affect the value of our Class A common stock.\nFuture sales of shares of our Class A common stock, or the perception that these sales could occur, could depress the market price of our Class A common stock.\nSales of a substantial number of shares of our Class A common stock in the public market, or the perception that these sales might occur, could cause the market price of our Class A common stock to decline or make it more difficult for you to sell your Class A common stock at a time and price that you deem appropriate, and could impair our ability to raise capital through the sale of additional equity securities. We are unable to predict the effect that sales, or the perception that our shares may be available for sale, will have on the prevailing market price of our Class A common stock. As of December 31, 2021, we had an aggregate of 0.8 million options outstanding that, if fully exercised, would result in the issuance of additional shares of Class A common stock or Class B common stock, as applicable. Our Class B common stock converts into Class A common stock on a one-for-one basis. In addition, as of December 31, 2021, we had 0.8 million RSUs, outstanding which, if fully vested and settled in shares, would result in the issuance of additional shares of Class A common stock. All of the shares of Class A common stock issuable upon the exercise of options (or upon conversion of shares of Class B common stock issued upon the exercise of options), or upon the vesting and settlement of RSUs, have been registered for public resale under the Securities Act. Accordingly, these shares will be able to be freely sold in the public market upon issuance. In addition, certain holders of our Class A common stock and Class B common stock have rights, subject to certain conditions, to require us to file registration statements for the public resale of such shares (in the case of Class B common stock, the Class A common stock issuable upon conversion of such shares) or to include such shares in registration statements that we may file for us or other stockholders. Any sales of securities by these stockholders could have a material adverse effect on the market price of our Class A common stock.\nWe do not expect to declare any dividends in the foreseeable future and may repurchase stock in accordance with our Share Repurchase Program.\nWe have never declared, and we do not anticipate declaring or paying, any cash dividends to holders of our Class A common stock in the foreseeable future. In addition, the terms of our future borrowing arrangements we may enter into from time to time may restrict our ability to pay dividends. Consequently, investors may need to rely on sales of our Class A common stock after price appreciation, which may never occur, as the only way to realize any future gains on their investment.\nPrice appreciation, which may never occur, may be further impacted by repurchases of our shares in accordance with our Share Repurchase Program. Repurchases of our shares could increase the volatility of the trading price of our shares, which could have a material adverse impact on the trading price of our shares. Similarly, the future announcement of the termination or suspension of the Share Repurchase Program, or our decision not to utilize the full authorized repurchase amount under the Share Repurchase Program, could result in a decrease in the trading price of our shares. In addition, the Share Repurchase Program could have the impact of diminishing our cash reserves, which may impact our ability to finance our growth, complete acquisitions and execute our strategic plan. For additional information regarding our Share Repurchase Program, refer to Note 11, Stockholders' Equity.\nAnti-takeover provisions contained in our amended and restated certificate of incorporation and amended and restated bylaws, as well as provisions of Delaware law, could impair a takeover attempt.\nOur amended and restated certificate of incorporation and our amended and restated bylaws contain provisions that could have the effect of rendering more difficult hostile takeovers, change-in-control transactions or changes in our Board of Directors or management. Among other things, these provisions authorize the issuance of preferred stock with powers, preferences and rights that may be senior to our common stock, provide for the adoption of a staggered three-class Board of Directors, prohibit our stockholders from filling vacancies on our Board of Directors or calling special stockholder meetings, require the vote of at least two-thirds of the combined voting power of our outstanding capital stock to approve amendments to our certificate of incorporation or bylaws, and require the approval of the holders of at least a majority of the outstanding shares of our Class B common stock voting as a separate class prior to consummating a change-in-control transaction. As a Delaware corporation, we are also subject to provisions of Delaware law, including Section 203 of the Delaware General Corporation Law, which may delay, deter or prevent a change-in-control transaction. Section 203 imposes certain restrictions on mergers, business combinations and other transactions between us and holders of 15% or more of our common stock. Any provision of Delaware law, our amended and restated certificate of incorporation, or our amended and restated bylaws that has the effect of rendering more difficult, delaying, deterring or preventing a change-in-control transaction could limit the opportunity for our stockholders to receive a premium for their shares of our capital stock and could also affect the price that some investors are willing to pay for our Class A common stock.\nRisks Related to Macroeconomic Conditions\nHealth epidemics, including the COVID-19 pandemic, could have a material adverse impact on our operations, employees culture, customers, and business partners.\nThe COVID-19 pandemic continues to have, and a future public health crisis could have, repercussions across local, regional, and global economies and financial markets. Travel restrictions, quarantines, and similar government orders to control the spread of COVID-19 or a future virus may result in business closures, work stoppages, slowdowns, and cancellation or postponement of events that, among other effects, could negatively impact our operations, as well as the operations of our customers, and business partners. The demand for our products and services, as well as our operating results, could be adversely\nimpacted due to customers delaying decisions to adopt our products and services or terminating their use of our products and services, as they seek to reduce or delay spending to mitigate the impact of the COVID-19 pandemic or a future public health crisis on their businesses.\nIn March of 2020, in an effort to protect our employees and comply with applicable government orders, in response to the COVID-19 pandemic, we transitioned our employees to a remote work environment. We began transitioning our employees back to the office in 2021; however, our employees have the option to work remotely until further notice. If the COVID-19 pandemic again requires full remote working conditions, it could have a material adverse impact on our products as the disruption to our operations may result in an increase in errors, failures, vulnerabilities, and bugs. Furthermore, the COVID-19 pandemic may have long-term effects on the nature of the office environment and remote working, which may present operational and workplace culture challenges that may adversely affect our business.\nAny of the factors described above, or any number of other risks related to the COVID-19 pandemic or a future public health crisis, could disrupt our business, which could have a material adverse impact on our business, operations and financial results.\nGlobal and regional economic conditions could harm our business.\nAdverse global and regional economic conditions such as turmoil affecting the banking system or financial markets, including, but not limited to, tightening in the credit markets, extreme volatility or distress in the financial markets, recessionary or inflationary pressures, supply chain issues, reduced consumer confidence or economic activity, government fiscal and tax policies, and other negative financial news or macroeconomic developments could have a material adverse impact on the demand for our products and services.\nNatural disasters or other catastrophic events may cause damage or disruption to our operations, commerce and the global economy, and have a negative effect on our business and operations.\nOur business operations are subject to interruption by natural disasters, flooding, fire, power shortages, pandemics, terrorism, political unrest, telecommunications failure, vandalism, cyber-attacks, geopolitical instability, war, the effects of climate change (such as drought, wildfires, hurricanes, increased storm severity and sea level rise) and other events beyond our control. Although we maintain crisis management and disaster response plans, such events could make it difficult or impossible for us to deliver our services to our customers, could decrease demand for our services, and could cause us to incur substantial expense. Our insurance may not be sufficient to cover losses or additional expenses that we may sustain. The majority of our research and development activities, offices, information technology systems, and other critical business operations are located near major seismic faults in California. Customer data could be lost, significant recovery time could be required to resume operations and our financial condition and operating results could be adversely affected in the event of a major natural disaster or catastrophic event. In addition, the impacts of climate change on the global economy and our industry are rapidly evolving. We may be subject to increased regulations, reporting requirements, standards or expectations regarding the environmental impacts of our business.\nGovernment regulations and laws are continuously evolving and unfavorable changes could adversely affect our operating results, subject us to litigation or governmental investigation, or otherwise harm our business.\nIn addition to regulations and laws directly applicable to our products and services, we are subject to general business regulations and laws. Unfavorable regulations, laws, and administrative or judicial decisions interpreting or applying laws and regulations applicable to our business could subject us to litigation or governmental investigation and increase our cost of doing business, any of which may adversely affect our operating results. In addition, the application of federal, state, local and foreign tax laws to services provided electronically is continuously evolving. New income, sales, use or other tax laws, statutes, rules, regulations or ordinances could be enacted or amended at any time, possibly with retroactive effect, and could be applied solely or disproportionately to services provided over the Internet. These enactments or amendments could adversely affect our sales activity due to the inherent cost increase such taxes would represent and could ultimately result in a negative impact on our operating results. In addition, existing tax laws, statutes, rules, regulations or ordinances could be interpreted, modified or applied adversely to us, possibly with retroactive effect, which could require us or our customers to pay additional tax amounts, as well as require us or our customers to pay fines or penalties, as well as interest on past amounts. If we are unsuccessful in collecting such taxes due from our customers, we could be held liable for such costs, thereby adversely impacting our operating results.",
    "item_1B": "ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.",
    "item_2": "ITEM 2. PROPERTIES\nOur corporate headquarters is located in Santa Barbara, California, where we lease approximately 166,000 square feet of space in three adjacent office buildings. We also lease office space in several other U.S. cities. We do not own any real estate.\nWe intend to procure additional space as we add employees and expand our operations geographically. We believe our current facilities are adequate for our current needs and that, should it be needed, suitable additional or alternative space will be available to us to accommodate any such expansion of our operations.",
    "item_3": "ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we are involved in various investigative inquiries, legal proceedings and other disputes arising from or related to matters incident to the ordinary course of our business activities, including actions with respect to intellectual property, employment, regulatory and contractual matters. Although the results of such investigative inquiries, legal proceedings and other disputes cannot be predicted with certainty, we believe that we are not currently a party to any matters which, if determined adversely to us, would, individually or taken together, have a material adverse effect on our business, operating results, financial condition or cash flows. However, regardless of the merit of any matters raised or the ultimate outcome, investigative inquiries, legal proceedings and other disputes may generally have an adverse impact on us as a result of defense and settlement costs, diversion of management resources, and other factors.\nFor additional information regarding legal proceedings, refer to Note 10, Commitments and Contingencies of our Consolidated Financial Statements.",
    "item_4": "ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II",
    "item_5": "ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for our Common Stock\nOur Class A common is listed on the NASDAQ Global Market under the symbol \"APPF\".\nOur Class B common stock is not listed or traded on any stock exchange.\nHolders of Record\nAt February 14, 2022, there were 39 holders of record of our Class A common stock and 72 holders of record of our Class B common stock. Because many of our shares of Class A common stock are held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of stockholders represented by these record holders.\nDividend Policy\nWe have never declared or paid any cash dividends on our capital stock. We do not anticipate declaring or paying any cash dividends to holders of our capital stock in the foreseeable future and intend to retain all future earnings for use in the growth of our business.\nStock Performance Graph\nThe following performance graph compares the cumulative total return on our Class A common stock with that of the S&P 500 Index and the NASDAQ Computer Index. This chart assumes $100 was invested in our Class A common stock at the close of market on December 31, 2016, and in the S&P 500 Index and the NASDAQ Computer Index, and assumes the reinvestment of any dividends.\nThe comparisons in the graph below are based upon historical data and are not indicative of, nor intended to forecast, future performance of our common stock.\nThis performance graph shall not be deemed “filed” for purposes of Section 18 of the Exchange Act or incorporated by reference into any of our other filings under the Securities Act or the Exchange Act, except as shall be expressly set forth by specific reference in such filing.\nUnregistered Sales of Equity Securities and Purchases of Equity Securities\nNone.",
    "item_6": "ITEM 6. [RESERVED]",
    "item_7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read together with our Consolidated Financial Statements and the related notes included elsewhere in this Annual Report. This discussion and analysis contains forward-looking statements that are based on our current expectations and reflect our plans, estimates and anticipated future financial performance. These statements involve numerous risks and uncertainties. Our actual results may differ materially from those expressed or implied by these forward-looking statements as a result of many factors, including those set forth in the section of this Annual Report entitled \"Risk Factors\". See the section of this Annual Report entitled “Forward-Looking Statements” for additional information.\nThe following discussion and analysis of our financial condition and results of operations discusses 2021 and 2020 items and year-over-year comparisons between 2021 and 2020. For discussion of 2019 items and year-over-year comparisons between 2020 and 2019, refer to Part II. Item 7. “Management's Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the year ended December 31, 2020.\nOverview\nWe are a leading provider of cloud business management solutions for the real estate industry. Our solutions enable our customers to digitally transform their businesses, automate and streamline critical business operations and deliver a better customer experience. Our products assist an interconnected and growing ecosystem of users, including property managers, property owners, real estate investment managers, rental prospects, residents, and service providers with critical transactions across the real estate lifecycle, including screening potential tenants, sending and receiving payments and even providing insurance-related risk mitigation services. AppFolio’s intuitive interface, coupled with streamlined and automated workflows, make it easier for our customers to eliminate redundant and manual processes so they can deliver a great experience for their users while improving financial and operational performance.\nWe rely heavily on our talented team of employees to execute our growth plans and achieve our long-term strategic objectives. We believe our people are at the heart of our success and our customers' success, and we have worked hard not only to attract and retain talented individuals, but also to provide a challenging and rewarding environment to motivate and develop our valuable human capital. In March 2020, in an effort to protect our employees and comply with applicable government orders in response to the COVID-19 pandemic, we transitioned our employees to a remote work environment. We began transitioning our employees back to the office in 2021; however, our employees have the option to work remotely until further notice.\nDuring certain periods covered by this Annual Report, we also provided software solutions and services to the legal industry via MyCase, a software solution primarily designed for small and mid-sized law firms. We completed our divestiture of MyCase, Inc. on September 30, 2020 (the \"MyCase Transaction\"). For additional details, see Note 3, Divestitures, of our Consolidated Financial Statements in this Annual Report.\nKey Business Metric\nProperty management units under management. We believe that our ability to increase our number of property management units under management is an indicator of our market penetration, the growth of our business, and our potential future business opportunities. We define property management units under management as the number of active units on our core solutions. We had 6.35 million and 5.36 million property management units under management as of December 31, 2021 and 2020, respectively.\nSeasonality\nWe have historically experienced seasonality in our Value Added Services revenue, primarily in our tenant screening services, due to seasonally higher leasing activities in the second quarter which increases tenant screening transactions in that period. We generally experience decreased tenant screening revenue in the fourth quarter, when seasonally lower leasing activities occur. Corresponding to the higher tenant applications in the second quarter, our property manager customers typically experience an increase in new tenants in the third quarter, resulting in a higher demand for our insurance-related risk mitigation services in that period. As a result of the seasonality of the rental lifecycle and the growth of our business, we have typically experienced a sequential increase in revenue in the first, second and third quarters and a sequential decline in revenue in the fourth quarter of each of our most recent fiscal years. These seasonal factors could be heightened or lessened due to the impact of a change in macroeconomic factors that could impact tenant behavior or a change in the adoption rate of our other less seasonally impacted Value Added Services. Although these seasonal factors are common in the real estate industry, historical patterns should not be considered a reliable indicator of our future sales activity or performance.\nKey Components of Results of Operations\nRevenue\nOur core solutions and certain of our Value Added Services are offered on a subscription basis. Our core solutions subscription fees vary by property type and are designed to scale to the size of our customers’ businesses. We recognize revenue for subscription-based services over time on a straight-line basis over the contract term beginning on the date that our service is made available. We generally invoice monthly or, to a lesser extent, annually in advance of the subscription period.\nWe also offer Value Added Services, which are not covered by our subscription fees, on a per use basis. Usage-based fees are charged either as a percentage of the transaction amount (e.g., for certain of our electronic payment services) or on a flat fee per transaction basis with no minimum usage commitments (e.g., for our tenant screening and risk mitigation services). We recognize revenue for usage-based services in the period the service is rendered. Our electronic payments services fees are recorded gross of the interchange and payment processing related fees. We generally invoice our usage-based services on a monthly basis or collect the fee at the time of service. A significant majority of our Value Added Services revenue comes\ndirectly and indirectly from the use of our electronic payment services, tenant screening services, and risk mitigation services. Usage-based fees are paid either by customers or by users.\nWe charge our customers for on-boarding assistance to our core solutions and certain other non-recurring services. We generally invoice for these other services in advance of the services being completed and recognize revenue upon completion of the related service. We generate revenue from the legacy customers of previously acquired businesses by providing services outside of our property management core solution platform. Revenue derived from these services is recorded in Other revenue.\nCosts and Operating Expenses\nCost of Revenue. Many of our Value Added Services are facilitated by third-party service providers. Cost of revenue paid to these third-party service providers includes the cost of electronic interchange and payment processing related services to support our electronic payments services, the cost of credit reporting services for our tenant screening services, and various costs associated with our risk mitigation service providers. These third-party costs vary both in amount and as a percent of revenue for each Value Added Service offering. Cost of revenue also consists of personnel-related costs for our employees focused on customer service and the support of our operations (including salaries, performance-based compensation, benefits, and stock-based compensation), platform infrastructure costs (such as data center operations and hosting-related costs), and allocated shared and other costs. Cost of revenue excludes depreciation of property and equipment, amortization of capitalized software development costs and amortization of intangible assets.\nSales and Marketing. Sales and marketing expense consists of personnel-related costs for our employees focused on sales and marketing (including salaries, sales commissions, performance-based compensation, benefits, and stock-based compensation), costs associated with sales and marketing activities, and allocated shared and other costs. Marketing activities include advertising, online lead generation, lead nurturing, customer and industry events, and the creation of industry-related content and collateral. Sales commissions and other incremental costs to acquire customers and grow adoption and utilization of our Value Added Services by our new and existing customers are deferred and then amortized on a straight-line basis over a period of benefit, which we have determined to be three years. We focus our sales and marketing efforts on generating awareness of our software solutions, creating sales leads, establishing and promoting our brands, and cultivating an educated community of successful and vocal customers.\nResearch and Product Development. Research and product development expense consists of personnel-related costs for our employees focused on research and product development (including salaries, performance-based compensation, benefits, and stock-based compensation), fees for third-party development resources, and allocated shared and other costs. Our research and product development efforts are focused on enhancing functionality and the ease of use of our existing software solutions by adding new core functionality, Value Added Services and other improvements, as well as developing new products and services for existing and adjacent markets. We capitalize our software development costs that meet the criteria for capitalization. Amortization of capitalized software development costs is included in depreciation and amortization expense.\nGeneral and Administrative. General and administrative expense consists of personnel-related costs for employees in our executive, finance, information technology, human resources, legal, compliance, corporate development and administrative organizations (including salaries, performance-based cash compensation, benefits, and stock-based compensation). In addition, general and administrative expense includes fees for third-party professional services (including audit, legal, compliance, tax, and consulting services), transaction costs related to business combinations and divestitures, regulatory fines and penalties, other corporate expenses, and allocated shared and other costs.\nDepreciation and Amortization. Depreciation and amortization expense includes depreciation of property and equipment, amortization of capitalized software development costs, and amortization of intangible assets. We depreciate or amortize property and equipment, software development costs, and intangible assets over their expected useful lives on a straight-line basis, which approximates the pattern in which the economic benefits of the assets are consumed.\nOther Income, Net. Other income, net includes the gain on sale of MyCase during fiscal year 2020, gain on sale of our equity-method investments, and gains and losses associated with the sale of property and equipment and investment securities.\nInterest Income (Expense), Net. Interest expense includes interest paid on any outstanding borrowings. Interest income includes interest earned on investment securities, amortization and accretion of the premium and discounts paid from the purchase of investment securities, and interest earned on notes receivable and on cash deposited in our bank accounts.\nProvision for Income Taxes. Provision for income taxes consists of federal and state income taxes in the United States.\nResults of Operations for the Years Ended December 31, 2021 and 2020\nThe following table presents our results of operations for the periods presented in dollars (in thousands) and as a percentage of revenue:\n(1) The following table presents stock-based compensation expense included in each respective expense category:\nRevenue\nRevenue for the years ended December 31, 2021 and 2020, was $359.4 million and $310.1 million, respectively, an increase of $49.3 million, or 16%. This increase was primarily attributable to the growth in the number of property management customers and units under management utilizing our core solutions and Value Added Services. Revenue in 2020 includes $25.4 million attributable to MyCase. Excluding this amount, revenue derived from the real estate industry for the years ended December 31, 2021 and 2020 increased $74.7 million, or 26%.\nCore solutions revenue derived from the real estate industry for the years ended December 31, 2021 and 2020 was $105.1 million and $86.5 million, respectively, an increase of $18.6 million or 22%. Value Added Services revenue derived from the real estate industry for the years ended December 31, 2021 and 2020 was $241.3 million and $184.2 million, respectively, an increase of $57.1 million or 31%. These increases in core solutions and Value Added Services revenue for the years ended December 31, 2021 and 2020 were mainly attributable to growth in our base of property management customers and growth in users of our subscription and usage-based services. During the twelve month period ended December 31, 2021, we experienced growth of 17% in the average number of property management units under management resulting from 9% growth in the average number of property management customers.\nOur electronic payment services experienced increased adoption during the comparative periods as residents, property managers, owners and customers transacted more business online. Our tenant screening and risk mitigation services usage also increased during the comparative periods in line with the increase in units under management. A significant majority of our Value Added Services revenue comes directly and indirectly from the use of our electronic payment services, tenant screening services, and the risk mitigation services we make available to customers.\nCost of Revenue (Exclusive of Depreciation and Amortization)\nCost of revenue (exclusive of depreciation and amortization) related to the real estate industry for the years ended December 31, 2021 and 2020 was $143.8 million and $109.7 million, respectively, an increase of $34.1 million, or 31%. For the years ended December 31, 2021 and 2020, expenditures to third-party service providers related to the delivery of our Value Added Services to the real estate industry increased $21.6 million, which was directly associated with the increased adoption and utilization of our Value Added Services, as evidenced by the $57.1 million increase in Value Added Services revenue to the real estate industry. Personnel-related costs, including performance-based compensation, necessary to support growth and key investments, increased $9.3 million. Allocated shared and other costs increased by $3.1 million primarily driven by an increase in software and other costs incurred in support of our overall growth.\nAs a percentage of revenue, cost of revenue (exclusive of depreciation and amortization) fluctuates primarily based on the mix of Value Added Services revenue in the period, given the varying percentage of revenue we pay to third-party service providers. For the year ended December 31, 2021, cost of revenue (exclusive of depreciation and amortization), as a percentage of revenue, increased to 40.0% from 38.5% for the year ended December 31, 2020. We expect the cost of revenues (exclusive of depreciation and amortization) for the year ending December 31, 2022, to increase as a percentage of revenue, as we expect expenditures to third-party service providers related to the delivery of our Value Added Services revenues to increase at a faster rate than total revenues as a result of a higher growth rate related to our Value Added Services revenues.\nSales and Marketing\nSales and marketing expense related to the real estate industry for the years ended December 31, 2021 and 2020 was $73.1 million and $52.5 million, respectively, an increase of $20.6 million, or 39%. This increase was primarily due to a $12.6 million increase in personnel-related costs, including performance-based compensation, necessary to support growth and key investments in the business. Advertising and promotion costs increased by $6.3 million primarily due to increased advertising and promotion spending to support the growth and key investments in the business. In addition, there was an increase in allocated shared and other costs of $1.7 million primarily related to software and other costs incurred in support of our overall growth.\nAs a percentage of revenue, sales and marketing expense increased to 20.3% from 18.4% for the year ended December 31, 2021 compared to the year ended December 31, 2020. This increase was due in part to lower advertising and promotion costs in 2020 as a result of fewer events and lower online marketing spend, as well as increased spend in 2021 to support our growth.\nResearch and Product Development\nResearch and product development expense related to the real estate industry for the years ended December 31, 2021 and 2020 was $65.9 million and $43.8 million, respectively, an increase of $22.1 million, or 50%. This increase was the result of an increase in personnel-related costs, including performance based compensation, net of capitalized software development costs, of $20.5 million due to investments in headcount growth within our research and product development organization. Allocated shared and other costs increased $1.6 million primarily related to software and other costs to support our growth.\nGeneral and Administrative\nGeneral and administrative expense related to the real estate industry and general corporate overhead expenses for the years ended December 31, 2021 and 2020 was $57.3 million and $46.1 million, respectively, an increase of $11.2 million, or 24%. The increase in general and administrative expense was primarily due to a $14.3 million increase in personnel-related costs for investments in headcount and an increase of $4.1 million in allocated shared and other costs for professional fees, education and training, insurance, software and other costs to support our growth. These increases were offset by a $1.9 million insurance recovery related to our previously disclosed settlement with the Federal Trade Commission (the \"FTC\") and a decrease in legal costs of $5.3 million related to our $4.3 million settlement with the FTC and a decrease in legal fees of $1.0 million related to the MyCase Transaction during the year ended December 31, 2020.\nDepreciation and Amortization\nDepreciation and amortization expense related to the real estate industry for the years ended December 31, 2021 and 2020 was $30.8 million and $25.0 million, respectively, an increase of $5.8 million, or 23%. The increase in depreciation and amortization expense was primarily due to increased amortization expense associated with higher accumulated capitalized software development balances.\nOther Income, net\n*Percentage not meaningful\nOther income, net for the years ended December 31, 2021 and 2020 was $13.1 million and $188.9 million, respectively, a decrease of $175.8 million. The decrease in other income, net was primarily due to the gain of $187.6 million associated with the MyCase Transaction in September 2020. The decrease was offset by a gain of $12.8 million related to the sale of our investment in SecureDocs, a portion of which relates to the recovery of a $2.0 million note receivable which had been previously reserved.\nProvision for Income Taxes\n*Percentage not meaningful\nFor the year ended December 31, 2021, we recorded income tax expense of $0.7 million. The effective tax rate as compared to the U.S. federal statutory rate of 21% differs primarily due to the significance of the benefits associated with stock-based compensation expense, research and development tax credits, and the change in the valuation allowance against deferred taxes.\nFor the year ended December 31, 2020 we recorded an income tax expense of $38.4 million. The tax provision for the year ended December 31, 2020 includes tax expense of $51.3 million relating to the MyCase Transaction which includes $52.3 million of current tax expense on the gain on the sale of MyCase, less a $1.0 million benefit on the reversal of deferred tax liabilities relating to MyCase. For tax purposes, we filed an election to treat the transaction as a sale of assets. As such, the tax impact takes into consideration the tax basis of the assets on the date of sale and the availability of net operating losses and research and development tax credits. The effective tax rate as compared to the U.S. federal statutory rate of 21% differs primarily due to state income taxes and the benefits associated with stock-based compensation expense and research and development tax credits.\nLiquidity and Capital Resources\nOur principal sources of liquidity continue to be composed of our cash, cash equivalents, and investment securities, as well as cash flows generated from our operations. At December 31, 2021, our cash and cash equivalents and investment securities had an aggregate balance of $183.5 million. We have financed our operations primarily through cash generated from operations. We believe that our existing cash and cash equivalents, investment securities, and cash generated from operating activities will be sufficient to meet our working capital and capital expenditure requirements for at least the next twelve months.\nCapital Requirements\nOur future capital requirements will depend on many factors, including continued market acceptance of our software solutions, changes in the number of our customers, adoption and utilization of our Value Added Services by new and existing customers, the timing and extent of the introduction of new core functionality, products and Value Added Services, the timing and extent of our expansion into new or adjacent markets, the timing and extent of our investments across our organization, and the impact of the COVID-19 pandemic (and other actual or potential events outside of our control) on the customers we serve and on our business. Non-cancelable purchase commitments for business operations total $13.2 million as of December 31, 2021, due primarily over the next 3 years. Operating lease obligations totaling $66.6 million associated with leased facilities and have varying maturities with $24.3 million due over the next five years. In addition, we have in the past entered into, and may in the future enter into, arrangements to acquire or invest in new technologies or markets adjacent to those we serve today. Furthermore, our Board of Directors has authorized our management to repurchase up to $100.0 million of shares of our Class A common stock from time to time. To date, we have repurchased $4.2 million of our Class A common stock under the Share Repurchase Program. For additional information regarding our Share Repurchase Program, refer to Note 11, Stockholders' Equity.\nCash Flows\nThe following table presents our cash flows for the periods indicated (in thousands):\nCash Provided by Operating Activities\nOur primary source of operating cash inflows is cash collected from our customers in connection with their use of our core solutions and Value Added Services. Our primary uses of cash from operating activities are for personnel-related expenditures and third-party costs incurred to support the delivery of our software solutions.\nFor the year ended December 31, 2021, cash provided by operating activities was $35.4 million resulting from income of $1.0 million, non-cash charges of $36.7 million and a net decrease in our operating assets and liabilities of $2.4 million. The non-cash charges primarily consist of $29.0 million of depreciation and amortization costs, stock-based compensation expense, including as amortized, of $17.2 million, a decrease in deferred taxes of $0.3 million, and $3.2 million of amortization of operating lease right-of-use (\"ROU\") assets. The net decrease in our operating assets and liabilities was mostly attributable to a $9.0 million decrease in income taxes payable primarily driven by income taxes paid due to the MyCase Transaction, a $2.2\nmillion increase in prepaid expenses and other current assets primarily attributable to increases in tenant improvement allowance receivable, deferred commission costs and prepaid expenses to support our overall growth, a $2.1 million increase in accounts receivable primarily driven by growth of our Value Added Services, and a $1.8 million decrease in accrued expenses which was primarily due to a $4.3 million legal expense accrued during the year ended December 31, 2020 and paid in the three months ended March 31, 2021 related to our settlement with the FTC. These decreases were partially offset by an $11.3 million increase in accrued employee expenses-current primarily due to an increase in short-term incentive compensation, an increase in payroll expense and accrued paid time off due to an increase in headcount, a $1.3 million increase in operating lease liabilities, a $0.6 million increase in accrued employee expenses-noncurrent due to an increase in accrued long-term management bonuses, and a $0.5 million increase in accounts payable.\nFor the year ended December 31, 2020, cash provided by operating activities was $48.3 million resulting from our net income of $158.4 million, adjusted by the gain related to the MyCase Transaction of $187.7 million, non-cash charges of $68.6 million and a net increase in our operating assets and liabilities of $8.9 million. The non-cash charges primarily consist of a decrease in deferred taxes of $29.0 million, depreciation and amortization costs of $25.5 million, stock-based compensation expense, including as amortized, of $10.3 million, and amortization of operating lease right-of-use assets of $3.7 million. The net increase in our operating assets and liabilities was mostly attributable to a $9.4 million increase in other liabilities primarily driven by income taxes payable due to the MyCase Transaction, a $6.9 million increase in accrued expenses which includes a $4.3 million accrual related to legal loss reserves, a $2.8 million increase in accrued employee expenses related to an overall increase in personnel-related costs, and a $0.5 million increase in deferred revenue. These increases were partially offset by a $2.8 million increase in accounts receivable primarily driven by growth of our Value Added Services, an increase in prepaid expenses and other current assets of $5.9 million primarily driven by an increase in prepaid expenses to support the growth in our business, an increase in deposits held with a third party related to requirements to maintain collateral for our risk mitigation services, and an increase in deferred costs, and a $0.9 million decrease in accounts payable due to timing of payments.\nCash (Used in) Provided by Investing Activities\nCash (used in) provided by investing activities is generally composed of purchases of investment securities, maturities and sales of investment securities, purchases of property and equipment, and additions to capitalized software development.\nFor the year ended December 31, 2021, investing activities used $110.5 million in cash primarily due to purchases of investment securities of $241.2 million, capitalized software development costs of $24.6 million and capital expenditures of $8.1 million to purchase property and equipment for the continued growth and expansion of our business. These uses of cash were partially offset by maturities and sales of investment securities of $107.4 million and $43.2 million, respectively, and proceeds from the sale of our equity-method investment of $12.5 million.\nFor the year ended December 31, 2020, investing activities provided $146.5 million in cash primarily due to net proceeds from the MyCase Transaction of $191.4 million and the proceeds from maturities and sales of investment securities of $27.3 million and $16.7 million, respectively. These sources of cash were partially offset by purchases of investment securities of $43.9 million, capitalized software development costs of $26.0 million, and capital expenditures of $19.0 million to purchase property and equipment primarily related to the growth and expansion of our headquarters in Santa Barbara, CA, a portion of which was reimbursed through tenant improvement allowances.\nCash Used in Financing Activities\nCash used in financing activities is generally comprised of net share settlements for employee tax withholdings associated with the vesting of restricted stock units (\"RSUs\"), the payment of contingent consideration under acquisition arrangements, activities associated with our former credit facility, activities related to the repurchase of our Class A common stock offset by proceeds from the exercise of stock options.\nFor the year ended December 31, 2021, financing activities used $7.3 million in cash primarily as a result of net share settlements for employee tax withholdings associated with the vesting of RSUs of $10.0 million, offset by proceeds from stock option exercises of $2.6 million.\nFor the year ended December 31, 2020, financing activities used $70.4 million in cash primarily as a result of the payment of all outstanding amounts due under the former credit facility of $99.6 million, net share settlements for employee tax withholdings associated with the vesting of RSUs of $12.2 million, payment of contingent consideration related to the 2019 acquisition of Dynasty Marketplace, Inc. of $6.0 million, and the repurchase of outstanding shares of Class A common stock in the amount of $4.2 million. These uses of cash were partially offset by proceeds from the Revolving Facility of $50.8 million.\nOff-Balance Sheet Arrangements\nAt December 31, 2021, we did not have any off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nOur Consolidated Financial Statements and the related notes included elsewhere in this Annual Report are prepared in accordance with generally accepted accounting principles in the United States. The preparation of our Consolidated Financial Statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the dates of the financial statements, and the reported amounts of revenue and expenses during the reporting period. Actual results could differ materially from those estimates.\nWe believe that the following critical accounting policies involve a greater degree of judgment or complexity than our other accounting policies. Accordingly, these are the policies we believe are the most critical to a full understanding and evaluation of our Consolidated Financial Statements. For additional information, refer to Note 2, Summary of Significant Accounting Policies of our Consolidated Financial Statements included elsewhere in this Annual Report.\nRevenue Recognition\nMany of our contracts with customers contain multiple performance obligations. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require judgment. We account for individual performance obligations separately if they are distinct. The performance obligations for these contracts include access and use of our core solutions, implementation services, and customer support. Access and use of our core solutions and implementation services are considered distinct.\nThe transaction price is allocated to each performance obligation on a relative standalone selling price basis. Judgment is required to determine the standalone selling price for each distinct performance obligation. We typically have more than one standalone selling price for individual products and services due to the stratification of those products and services by customers and circumstances. In these instances, we determine the standalone selling price based on our overall pricing objectives, taking into consideration customer demographics and other factors. Fees are fixed based on rates specified in the subscription agreements, which do not provide for any refunds or adjustments.\nCapitalized Software Development Costs\nWe believe there are two key estimates within the capitalized software balance, which are the determination of the useful life of the software and the determination of the amounts to be capitalized.\nWe determined that a three year life is appropriate for our internal-use software based on our best estimate of the useful life of the internally developed software after considering factors such as continuous developments in the technology, obsolescence and anticipated life of the service offering before significant upgrades. Based on our prior experience, internally generated software will generally remain in use for a minimum of three years before being significantly replaced or modified to keep up with evolving customer and company needs. While we do not anticipate any significant changes to this three year estimate, a change in this estimate could produce a material impact on our financial statements.\nWe determine the amount of internal software costs to be capitalized based on the amount of time spent by our software engineers on projects. Costs associated with building or significantly enhancing our software solutions and new internally built software solutions are capitalized, while costs associated with planning new developments and maintaining our software solutions are expensed as incurred. There is judgment involved in estimating the stage of development as well as estimating time allocated to a particular project. A significant change in the time spent on each project could have a material impact on the amount capitalized and related amortization expense in subsequent periods.\nIncome Taxes\nWe recognize deferred tax liabilities and assets for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in the Consolidated Statements of Operations in the period that includes the enactment date. A valuation allowance is recorded when it is more likely than not that some of the deferred tax assets will not be realized. In evaluating the need for a valuation allowance, management considers the weighting of all available positive and negative evidence, which includes, among other things, the nature, frequency and severity of current and cumulative taxable income or losses, future projections of profitability, and the duration of statutory carryforward periods.\nJudgment is required to measure the amount of tax benefits that can be recognized associated with uncertain tax positions. We recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in our Consolidated Financial Statements from such positions are then measured based on the largest benefit that has a greater than 50% likelihood of being realized. We recognize interest and penalties accrued with respect to uncertain tax positions, if any, in our provision for income taxes in the Consolidated Statements of Operations.\nRecent Accounting Pronouncements\nFor information regarding recent accounting pronouncements, refer to Note 2, Summary of Significant Accounting Policies of our Consolidated Financial Statements included elsewhere in this Annual Report.",
    "item_7A": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURE ABOUT MARKET RISK\nInterest Rate Risk\nInvestment Securities\nAt December 31, 2021, we had cash and cash equivalents of $57.8 million consisting of bank deposits and money market funds, and $125.7 million of investment securities consisting of United States government agency securities, corporate bonds and treasury securities. The primary objective of investing in securities is to support our liquidity and capital needs. We did not purchase these investments for trading or speculative purposes and have not used any derivative financial instruments to manage our interest rate risk exposure.\nOur investment securities are exposed to market risk due to interest rate fluctuations. While fluctuations in interest rates do not impact our interest income from our investment securities as all of these securities have fixed interest rates, changes in interest rates may impact the fair value of the investment securities. Since our investment securities are held as available for sale, all changes in fair value impact our other comprehensive income unless an investment security is considered impaired in which case changes in fair value are reported in other expense. As of December 31, 2021, a hypothetical 100 basis point decrease in interest rates would have resulted in an increase in the fair value of our investment securities of approximately $0.7 million, and a hypothetical 100 basis point increase in interest rates would have resulted in a decrease in the fair value of our investment securities of approximately $1.2 million. This estimate is based on a sensitivity model which measured an instant change in interest rates by 100 basis points as of December 31, 2021.\nInflation Risk\nWe do not believe that inflation has had a material effect on our business. However, if our costs, in particular personnel, sales and marketing and hosting costs, were to become subject to significant inflationary pressures, we may not be able to fully offset such higher costs through price increases. Our inability or failure to do so could harm our business, operating results and financial condition.\nForeign Currency Exchange Rate Risk\nWe have not been exposed to, nor do we anticipate being exposed to, material risks relating to foreign currency exchange rate fluctuations.",
    "item_8": "ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 238)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Income\nConsolidated Statements of Stockholders' Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of AppFolio, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of AppFolio, Inc. and its subsidiaries (the “Company”) as of December 31, 2021 and 2020, and the related consolidated statements of operations, of comprehensive income, of stockholders’ equity and of cash flows for each of the three years in the period ended December 31, 2021, including the related notes (collectively referred to as the “consolidated financial statements”). We also have audited the Company's internal control over financial reporting as of December 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2021 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of December 31, 2021, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Management’s Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Company’s consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA company’s internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company’s internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company’s assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nUncertain Tax Positions\nAs described in Notes 2 and 13 to the consolidated financial statements, the Company has recorded reserves for unrecognized tax benefits from uncertain tax positions of $7.8 million as of December 31, 2021. Judgment is required to measure the amount of tax benefits that can be recognized associated with uncertain tax positions. Management recognizes the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized from such positions are then measured based on the largest benefit that has a greater than 50% likelihood of being realized.\nThe principal considerations for our determination that performing procedures relating to uncertain tax positions is a critical audit matter are (i) the significant judgment by management when determining uncertain tax positions and measuring the amount of reserve required to be recognized, (ii) the significant auditor judgment, subjectivity, and effort in performing procedures and evaluating audit evidence related to management’s identification of uncertain tax positions and measurement of the amount of tax benefits recognized associated with uncertain tax positions, and (iii) the audit effort involved the use of professionals with specialized skill and knowledge.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the identification and recognition of the reserves for uncertain tax positions. These procedures also included, among others (i) evaluating management’s process for identifying uncertain tax positions and measuring the amount of the reserve required, (ii) testing the completeness of management’s assessment of the identification of uncertain tax positions, and (iii) testing the reasonableness of management’s assessment of the technical merits of the tax positions and estimates of the amount of tax benefit expected to be realized. Professionals with specialized skill and knowledge were used to assist in the evaluation of the Company’s uncertain tax positions related to the application of relevant tax laws.\n/s/ PricewaterhouseCoopers LLP\nLos Angeles, California\nFebruary 28, 2022\nWe have served as the Company’s auditor since 2012.\nAPPFOLIO, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except par values)\nThe accompanying notes to the Consolidated Financial Statements are an integral part of these statements.\nAPPFOLIO, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share amounts)\nThe accompanying notes to the Consolidated Financial Statements are an integral part of these statements.\nAPPFOLIO, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in thousands)\nThe accompanying notes to the Consolidated Financial Statements are an integral part of these statements.\nAPPFOLIO, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\n(in thousands)\nThe accompanying notes to the Consolidated Financial Statements are an integral part of these statements.\nAPPFOLIO, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nThe following table presents a reconciliation of cash, cash equivalents and restricted cash reported within the Consolidated Balance Sheets to the total of the same such amounts shown above (in thousands):\nThe accompanying notes to the Consolidated Financial Statements are an integral part of these statements.\nAPPFOLIO, INC.\nNOTES TO CONSOLIDATED AUDITED FINANCIAL STATEMENTS\n1. Nature of Business\nAppFolio, Inc. (the \"Company,\" \"we,\" \"us\" or \"our\") is a leading provider of cloud business management solutions for the real estate industry. Our solutions enable our customers to digitally transform their businesses, automate and streamline critical business operations and deliver a better customer experience. We were founded in 2006 with the vision to revolutionize vertical industry businesses by providing great software and services. Our mission is even more relevant today, digital transformation is effectively a requirement for business success in the modern world, and the way we work and live today requires powerful software solutions to enable a more seamless experience.\nDuring the years ended December 31, 2020 and 2019, we also provided cloud-based solutions and services to the legal industry via MyCase, a solution primarily designed for small and mid-sized law firms. As previously disclosed, we completed our divestiture of MyCase, Inc. on September 30, 2020. For additional details, see Note 3, Divestitures.\n2. Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying Consolidated Financial Statements were prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nReclassification\nWe reclassified certain amounts in our Consolidated Statements of Cash Flows within the cash flows from operating activities section in the prior year to conform to the current year's presentation.\nPrinciples of Consolidation\nThe accompanying Consolidated Financial Statements include the operations of AppFolio, Inc. and its wholly owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation.\nOur investment in SecureDocs, Inc. (“SecureDocs”) is accounted for under the equity method of accounting as we have the ability to exert significant influence, but do not control and are not the primary beneficiary of the entity. Our investment in SecureDocs is not material and any income (loss) activity is not material individually or in the aggregate to our Consolidated Financial Statements for any period presented. In December 2021, we sold our interest in SecureDocs. Refer to Note 4, Investments for additional information.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the dates of the financial statements, and the reported amounts of revenue, expenses, other income, and provision for income taxes during the reporting period. Assets and liabilities which are subject to judgment and use of estimates include the fair value of financial instruments, capitalized software development costs, period of benefit associated with deferred costs, incremental borrowing rate used to measure operating lease liabilities, the recoverability of goodwill and long-lived assets, income taxes, useful lives associated with property and equipment and intangible assets, contingencies, assumptions underlying performance-based compensation (whether cash or stock-based), and valuation and assumptions underlying stock-based compensation and other equity instruments. Actual results could differ from those estimates and any such differences may have a material impact on our Consolidated Financial Statements.\nSegment Information\nOur chief operating decision maker reviews financial information presented on an aggregated and consolidated basis, together with revenue information for our core solutions, Value Added Services, and other service offerings, principally to make decisions about how to allocate resources and to measure our performance. Accordingly, we have determined that we have one reportable and operating segment.\nConcentrations of Credit Risk\nFinancial instruments that potentially subject us to credit risk consist principally of cash, cash equivalents, restricted cash, accounts receivable, investment securities and notes receivable. We maintain cash balances at financial institutions in excess of amounts insured by United States government agencies or payable by the United States government directly. We\nplace our cash with high credit, quality financial institutions. We invest in investment securities with a minimum rating of A by Standard & Poor's or A-1 by Moody's and regularly monitor our investment security portfolio for changes in credit ratings.\nConcentrations of credit risk with respect to accounts receivable and revenue are limited due to a large, diverse customer base. No individual customer represented 10% or more of accounts receivable at December 31, 2021 and 2020 or revenue for the years ended December 31, 2021, 2020 and 2019.\nFair Value Measurements\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. We use a fair value hierarchy based on three levels of inputs, of which the first two are considered observable and the last unobservable, that may be used to measure fair value, which are the following:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Inputs other than Level 1 that are observable, either directly or indirectly, in the marketplace.\nLevel 3 - Unobservable inputs that are supported by little or no market activity.\nCash, Cash Equivalents and Restricted Cash\nWe consider all highly liquid investments, readily convertible to cash, and which have a remaining maturity date of three months or less at the date of purchase, to be cash equivalents. Cash and cash equivalents are recorded at fair value and consist primarily of bank deposits and money market funds.\nInvestment Securities\nOur investment securities currently consist of corporate bonds, United States government agency securities and treasury securities. We classify investment securities as available-for-sale at the time of purchase and reevaluate such classification at each balance sheet date. All investments are recorded at estimated fair value and investments with original maturities of less than one year at the time of purchase are classified as short-term. Unrealized gains and losses for available-for-sale investment securities are included in accumulated other comprehensive income, a component of stockholders' equity.\nFor available-for-sale debt securities in an unrealized loss position, we first assess whether we intend to sell, or whether it is more likely than not that we will be required to sell the security before recovery of its amortized cost basis. If either of these criteria is met, the security’s amortized cost basis is written down to fair value through income. For securities in an unrealized loss position that do not meet these criteria, we evaluate whether the decline in fair value has resulted from credit loss or other factors. If this assessment indicates a credit loss exists, the credit-related portion of the loss is recorded as an allowance for losses on the security. No allowance for credit losses for available-for-sale investment securities was recorded as of December 31, 2021 and 2020.\nAccounts Receivable\nAccounts receivable are recorded at the invoiced amount, net of an allowance for credit losses. The allowance for credit losses is based on historical loss experience, the number of days that receivables are past due, and an evaluation of the potential risk of loss associated with delinquent accounts. Accounts receivable considered uncollectible are charged against the allowance for credit losses when identified. We do not have any off-balance sheet credit exposure related to our customers. At December 31, 2021 and 2020, our allowance for credit losses was not material.\nProperty and Equipment\nProperty and equipment is stated at cost net of accumulated depreciation. Depreciation is calculated using the straight-line method over the estimated useful lives of assets as follows:\nLeases\nWe determine if an arrangement is a lease at inception. Operating lease ROU assets and operating lease liabilities are recognized based on the present value of the future minimum lease payments, over the lease term at commencement date. As none of our leases provide an implicit rate, we use our incremental borrowing rate based on the information available at\ncommencement date in determining the present value of future payments. The operating lease ROU assets also include any lease payments made to the lessor before or at the lease commencement date and excludes lease incentives received and initial direct costs incurred. Our lease terms may include options to extend the lease when it is reasonably certain that we will exercise that option.\nLease expense for minimum lease payments is recognized on a straight-line basis over the lease term. We have lease arrangements with lease and non-lease components, which are generally accounted for as a single lease component. Leases with an initial term of twelve months or less are not recorded on the balance sheet; we recognize lease expense for these leases on a straight-line basis over the lease term.\nCapitalized Software Development Costs\nSoftware development costs consist of certain payroll and stock compensation costs incurred to develop functionality of our internal-use software solutions. We capitalize certain software development costs for new offerings as well as significant upgrades and enhancements to our existing software solutions. Capitalized software development costs are amortized using the straight-line method over an estimated useful life of three years. We do not transfer ownership of our software, license, or lease our software to third parties.\nGoodwill and Intangible Assets\nGoodwill is tested for impairment at least annually at the reporting unit level or at other times if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying amount. A qualitative assessment is performed to determine whether it is more likely than not that the fair value of its reporting unit is less than its carrying amount. A quantitative assessment is performed if the qualitative assessment results in a more-likely-than-not determination or if a qualitative assessment is not performed. The quantitative assessment considers whether the carrying amount of a reporting unit exceeds its fair value, in which case an impairment charge is recorded to the extent that the reporting unit’s carrying value exceeds its fair value.\nWe test for goodwill impairment annually during the fourth quarter of the calendar year. Based on the assessment performed at November 1, 2021, we determined it was unlikely that our reporting unit fair value was less than its carrying value and no quantitative impairment test assessment was required. No impairment losses were recorded for goodwill during the years ended December 31, 2021, 2020 and 2019.\nIntangible assets primarily consist of acquired database and technology, non-compete agreements, customer and partner relationships, trademarks and trade names, domain names and patents, which are recorded at cost, less accumulated amortization. We determine the appropriate useful life of our intangible assets by performing an analysis of expected cash flows of the acquired assets. Intangible assets are amortized over their estimated useful lives on a straight-line basis, which approximates the pattern in which the economic benefits of the assets are consumed.\nImpairment of Long-Lived Assets\nWe assess the recoverability of our long-lived assets when events or changes in circumstances indicate that the carrying value of an asset may not be recoverable or that the useful lives of those assets are no longer appropriate. An impairment charge would be recognized when the carrying amount of a long-lived asset or asset group is not recoverable and exceeds its fair value. The carrying amount of a long-lived asset or asset group is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset or asset group. There were no impairment charges related to the identified long-lived assets for the years ended December 31, 2021, 2020 and 2019.\nRevenue Recognition\nWe generate revenue from our customers primarily for subscriptions to access our core solutions and Value Added Services. Revenue is recognized upon transfer of control of promised services in an amount that reflects the consideration we expect to receive in exchange for those services. We enter into contracts that can include various combinations of services, which are generally capable of being distinct, distinct within the context of the contract, and accounted for as separate performance obligations. Revenue is recognized net of any taxes collected from customers, which are subsequently remitted to governmental authorities. We do not disclose the value of unsatisfied performance obligations for contracts with an original expected term of one year or less. We recognize revenue in proportion to the amount we have the right to invoice for certain core solutions and Value Added Services revenue, as that amount corresponds directly with our performance completed to date. Refer to Note 14, Revenue and Other Information for the disaggregated breakdown of revenue between Core solutions, Value Added Services and Other revenue.\nCore Solutions\nWe charge our customers on a subscription basis for our core solutions. Our subscription fees are designed to scale to the size of our customers' businesses. Subscription fees for our core solutions are charged on a per-unit per-month basis for our property management software solution and on a per-user per-month basis for our legal software solution. Our customers do not have rights to the underlying software code of our solutions, and, accordingly, we recognize subscription revenue over time on a straight-line basis over the contract term beginning on the date that our service is made available to the customer. The term of our core solutions subscription agreements typically ranges from one month to one year. We typically invoice our customers for subscription services in monthly or annual installments, in advance of the subscription period.\nValue Added Services\nWe charge our customers on a subscription or usage basis for our Value Added Services. Subscription-based fees are charged on a per-unit basis. We typically invoice our customers for subscription-based services in monthly installments, in advance of the subscription period. We recognize revenue for subscription-based services over time on a straight-line basis over the contract term beginning on the date that our service is made available to the customer. Usage-based fees are charged either as a percentage of the transaction amount (e.g., for certain of our electronic payment services) or on a flat fee per transaction basis with no minimum usage commitments (e.g., for our tenant screening and risk mitigation services). We recognize revenue for usage-based services in the period the service is rendered. Our electronic payments services fees are recorded gross of the interchange and payment processing related fees. We generally invoice our customers for usage-based services on a monthly basis for services rendered in the preceding month. In addition, some subscription or usage-based Value Added Services, such as fees for electronic payment services, are paid by either our customers or clients of our customers at the time the services are rendered.\nWe work with third-party partners to provide certain of our Value Added Services. For these Value Added Services, we evaluate whether we are the principal, and report revenue on a gross basis, or the agent, and report revenue on a net basis. In this assessment we consider if we obtain control of the specified services before they are transferred to the customer, as well as other indicators such as whether we are the party primarily responsible for fulfillment, and whether we have discretion in establishing price.\nOther Revenue\nOther revenue include fees from one-time services related to the implementation of our software solutions and other recurring or one-time fees related to our customers who are not otherwise using our core solutions. This includes legacy customers of businesses we have acquired where the customers haven't migrated to our core solutions. The fees for implementation and data migration services are billed upon signing our core subscription contract and are not recognized until the core solution is accessible and fully functional for our customer's use. Other services are billed when the services rendered are completed and delivered to the customer or billed in advance and deferred over the subscription period.\nDeferred Revenue\nWe record deferred revenue when cash payments are received in advance of our performance. During the twelve months ended December 31, 2021 and 2020, we recognized revenue of $2.2 million and $4.5 million, respectively, that were included in the deferred revenue balances at December 31, 2020 and 2019, respectively.\nDeferred Costs\nDeferred costs, which primarily consist of sales commissions, are considered incremental and recoverable costs of obtaining a contract with a customer. These costs are deferred and then amortized on a straight-line basis over a period of benefit that we have determined to be three years. We typically do not pay commissions for contract renewals. We determined the period of benefit by taking into consideration our customer contract term, the useful life of our internal-use software, average customer life, and other factors. Amortization expense for the deferred costs is allocated based on the employee's department and included within sales and marketing expense in the accompanying Consolidated Statements of Operations.\nDeferred costs were $12.4 million and $10.3 million at December 31, 2021 and 2020, respectively, of which $6.4 million and $5.5 million, respectively, are included in Prepaid expenses and other current assets and $6.0 million and $4.8 million, respectively, are included in Other assets in the accompanying Consolidated Balance Sheets. Amortization expense for deferred costs was $6.8 million, $5.8 million, and $4.2 million for the years ended December 31, 2021, 2020, and 2019, respectively. For the years ended December 31, 2021 and 2020, no impairments were identified in relation to the costs capitalized for the periods presented.\nCost of Revenue\nMany of our Value Added Services are facilitated by third-party service providers. Cost of revenue paid to these third-party service providers includes the cost of electronic interchange and payment processing related services to support our electronic payments services, the cost of credit reporting services for our tenant screening services, and various costs associated with our risk mitigation service providers. These third-party costs vary both in amount and as a percent of revenue for each Value Added Service offering. Cost of revenue also consists of personnel-related costs for our employees focused on customer service and the support of our operations (including salaries, performance-based compensation, benefits, and stock-based compensation), platform infrastructure costs (such as data center operations and hosting-related costs), and allocated shared and other costs. Cost of revenue excludes depreciation of property and equipment, amortization of capitalized software development costs and amortization of intangible assets.\nSales and Marketing\nSales and marketing expense consists of personnel-related costs (including salaries, sales commissions, performance-based compensation, benefits, and stock-based compensation) for our employees focused on sales and marketing, costs associated with sales and marketing activities, and allocated shared and other costs. Marketing activities include advertising, online lead generation, lead nurturing, customer and industry events, and the creation of industry-related content and collateral. Sales commissions and other incremental costs to acquire customers and grow adoption and utilization of our Value Added Services by our new and existing customers are deferred and then amortized on a straight-line basis over a period of benefit, which we have determined to be three years. We focus our sales and marketing efforts on generating awareness of our software solutions, creating sales leads, establishing and promoting our brands, and cultivating an educated community of successful and vocal customers. Advertising expenses were $9.4 million, $7.0 million and $5.8 million for each of the years ended December 31, 2021, 2020 and 2019, respectively, and are expensed as incurred.\nResearch and Product Development\nResearch and product development expense consists of personnel-related costs (including salaries, performance-based compensation, benefits, and stock-based compensation) for our employees focused on research and product development, fees for third-party development resources, and allocated shared and other costs. Our research and product development efforts are focused on enhancing functionality and the ease of use of our existing software solutions by adding new core functionality, Value Added Services and other improvements, as well as developing new products and services for new and existing markets. We capitalize our software development costs which meet the criteria for capitalization. Amortization of capitalized software development costs is included in depreciation and amortization expense.\nGeneral and Administrative\nGeneral and administrative expense consists of personnel-related costs (including salaries, a majority of total performance-based compensation, benefits, and stock-based compensation) for employees in our executive, finance, information technology, human resources, legal, compliance, corporate development and administrative organizations. In addition, general and administrative expense includes fees for third-party professional services (including audit, legal, compliance, tax, and consulting services), transaction costs related to business combinations and divestitures, regulatory fines and penalties, other corporate expenses, and allocated shared costs.\nDepreciation and Amortization\nDepreciation and amortization expense includes depreciation of property and equipment, amortization of capitalized software development costs, and amortization of intangible assets. We depreciate or amortize property and equipment, software development costs, and intangible assets over their expected useful lives on a straight-line basis, which approximates the pattern in which the economic benefits of the assets are consumed.\nStock-Based Compensation\nWe recognize stock-based compensation expense for restricted stock awards (\"RSAs\") and restricted stock units (\"RSUs\") with only service conditions on a straight-line basis over the requisite service period. For RSUs with both service and performance conditions (performance-based RSUs or performance share units (\"PSUs\")), compensation cost is recorded on a graded-vesting method, if it is probable that the performance condition will be achieved. Adjustments to compensation expense are made each period based on changes in our estimate of the number of PSUs that are probable of vesting. PSUs will vest upon achievement of the relevant performance metric once such calculation is reviewed and approved by our Board of Directors. We estimate a forfeiture rate to calculate our stock-based compensation expense for our stock-based awards.\nIncome Taxes\nWe recognize deferred tax liabilities and assets for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be\nrecovered or settled. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in the Consolidated Statements of Operations in the period that includes the enactment date. A valuation allowance is recorded when it is more likely than not that some of the deferred tax assets will not be realized. In evaluating the need for a valuation allowance, management considers the weighting of all available positive and negative evidence, which includes, among other things, the nature, frequency and severity of current and cumulative taxable income or losses, future projections of profitability, and the duration of statutory carryforward periods.\nNet Income per Common Share\nBasic net income per share includes no dilution and is computed by dividing net income for the period by the weighted average number of common shares outstanding during the period. Diluted net income per share is computed by dividing net income for the period by the weighted average number of shares of common stock and potentially dilutive common stock outstanding during the period. The dilutive effect of outstanding options and equity incentive awards is reflected in diluted net income per share by application of the treasury stock method. The calculation of diluted net income per share excludes all anti-dilutive common shares.\nNet income per common share was the same for shares of our Class A and Class B common stock because they are entitled to the same liquidation and dividend rights and are therefore combined in the table below. The following table presents a reconciliation of the weighted average number of shares of our Class A and Class B common stock used to compute net income per common share (in thousands):\nFor the years ended December 31, 2021, 2020 and 2019, an aggregate of 181,000, 79,000 and 187,000 shares, respectively, underlying performance-based stock options and PSUs were not included in the computations of diluted and anti-dilutive shares as they are considered contingently issuable upon satisfaction of pre-defined performance measures and their respective performance measures have not been met. RSUs with an anti-dilutive effect were excluded from the calculation of weighted average number of shares used to compute diluted net income per common share and they were not material for the years ended December 31, 2021, 2020 and 2019.\nRecent Accounting Pronouncements Adopted in 2021\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (\"ASU 2019-12\"). This amendment was issued to simplify the accounting for income taxes by removing certain exceptions for recognizing deferred taxes, performing intraperiod allocation, and calculating income taxes in interim periods. Further, ASU 2019-12 adds guidance to reduce complexity in certain areas, including recognizing deferred taxes for tax basis goodwill and allocating taxes to members of a consolidated group. This guidance also requires an entity to reflect the effect of an enacted change in tax laws or rates in its effective income tax rate in the first interim period that includes the enactment date of the new legislation, aligning the timing of recognition of the effects from enacted tax law changes on the effective income tax rate with the effects on deferred income tax assets and liabilities. Under existing guidance, an entity recognizes the effects of the enacted tax law change on the effective income tax rate in the period that includes the effective date of the tax law. We adopted ASU 2019-12 on January 1, 2021. The adoption of this guidance did not have a material impact on our financial condition, results of operations, cash flows or disclosures.\nRecent Accounting Pronouncements Not Yet Adopted\nIn October 2021, the FASB issued ASU 2021-08, \"Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers,\" which requires contract assets and contract liabilities acquired in a business combination to be recognized and measured by the acquirer on the acquisition date in accordance with ASC 606, \"Revenue from Contracts with Customers,\" as if the acquirer had originated the contracts. ASU 2021-08 is effective for fiscal years and interim reporting periods within those fiscal years beginning after December 15, 2022. We will adopt ASU 2021-08 on January 1, 2023 on a prospective basis to business combinations that occur on or after the adoption date. The Company is currently evaluating the effect, if any, the adoption of this guidance will have on our financial condition, results of operations, cash flows and disclosures.\n3. Divestitures\nDivestiture of MyCase\nOn September 30, 2020, we completed our divestiture of 100% of our issued and outstanding equity interests of MyCase, Inc. (\"MyCase\"), a former wholly owned subsidiary that provided legal practice and case management software solutions to our legal customers, for $193.0 million, consisting of $192.2 million of cash proceeds, plus a $2.2 million employee retention bonus pool funded by us, less cash divested of $0.8 million and a preliminary working capital adjustment of $0.6 million (the \"MyCase Transaction\"). The retention bonus pool was refundable to the Company to the extent that MyCase employees were terminated prior to the retention period, which was one year from the closing date of the MyCase Transaction.\nWe recognized a pre-tax gain on the sale of $188.0 million on the MyCase Transaction, consisting of cash proceeds of $192.2 million, less net assets divested of $4.6 million, plus an adjustment in the employee retention bonus pool of $0.4 million. Net assets divested is primarily comprised of capitalized software of $3.9 million, deferred revenue of $2.8 million and goodwill allocated to MyCase of $2.3 million. The gain on the sale was recorded within Other income, net. Income received during the twelve months ended December 31, 2021 and 2020 in relation to the transition services provided by us to MyCase was $2.4 million and $1.1 million, respectively, and is included within Other income, net in our Consolidated Statements of Operations.\n4. Investments and Fair Value Measurements\nInvestment Securities\nInvestment securities classified as available-for-sale consisted of the following at December 31, 2021 and 2020 (in thousands):\nAt December 31, 2021 and 2020, the contractual maturities of our investments did not exceed 36 months. The fair values of available-for-sale investments, by remaining contractual maturity, are as follows (in thousands):\nDuring the years ended December 31, 2021 and 2020, we had sales and maturities (which include calls) of investment securities, as follows (in thousands):\nSecureDocs\nIn December 2021, we sold all of our interest in SecureDocs. A gain of $12.8 million was recognized within Other income, net in our Consolidated Statements of Operations, a portion of which relates to the recovery of a $2.0 million note receivable which had been previously reserved.\nFair Value Measurements\nRecurring Fair Value Measurements\nFinancial assets and financial liabilities are classified in their entirety based on the lowest level of input that is significant to the fair value measurement. The following tables present our financial assets and liabilities measured at fair value on a recurring basis at December 31, 2021 and 2020, by level within the fair value hierarchy (in thousands):\nThe carrying amounts of cash equivalents, restricted cash, accounts receivable, accounts payable and accrued liabilities approximate fair value because of the short maturity of these items.\nThere were no changes to our valuation techniques used to measure asset and liability fair values on a recurring basis during the year ended December 31, 2021. The valuation techniques for the financial assets in the tables above are as follows:\nCash Equivalents\nAt December 31, 2021 and 2020, cash equivalents include cash invested in money market funds and treasury securities with a maturity of three months or less. Fair value is based on market prices for identical assets.\nAvailable-for-Sale Investment Securities\nFair value for our Level 1 investment securities is based on market prices for identical assets. Our Level 2 securities were priced by a pricing vendor. The pricing vendor utilizes the most recent observable market information in pricing these securities or, if specific prices are not available for these securities, other observable inputs like market transactions involving comparable securities are used.\n5. Property and Equipment, net\nProperty and equipment, net consists of the following (in thousands):\nDepreciation expense for property and equipment totaled $4.7 million, $4.0 million, and $3.1 million for the years ended December 31, 2021, 2020 and 2019, respectively.\n6. Capitalized Software Development Costs, net\nCapitalized software development costs, net were as follows (in thousands):\nCapitalized software development costs were $27.2 million, $27.3 million and $23.6 million for the years ended December 31, 2021, 2020 and 2019, respectively. Amortization expense with respect to software development costs totaled $21.5 million, $17.9 million and $14.0 million for the years ended December 31, 2021, 2020 and 2019, respectively. During the year ended December 31, 2021, we disposed of $8.8 million of fully amortized capitalized software development costs.\nFuture amortization expense with respect to capitalized software development costs at December 31, 2021 is estimated as follows (in thousands):\n7. Intangible Assets, net\nIntangible assets, net consisted of the following (in thousands, except years):\nAmortization expense with respect to intangible assets totaled $4.6 million, $4.9 million and $5.3 million for the years ended December 31, 2021, 2020 and 2019, respectively. Future amortization expense with respect to intangible assets is estimated as follows (in thousands):\n8. Accrued Employee Expenses\nAccrued employee expenses consisted of the following (in thousands):\n9. Leases\nOperating leases for our corporate offices have remaining lease terms ranging from one to eleven years, some of which include options to extend the leases for up to ten years. These options to extend have not been recognized as part of our operating lease right-of-use assets and lease liabilities as it is not reasonably certain that we will exercise these options. Our lease agreements do not contain any residual value guarantees or material restrictive covenants. Certain leases contain provisions for property-related costs that are variable in nature for which the Company is responsible, including common area maintenance, which are expensed as incurred.\nThe components of lease expense recognized in the Consolidated Statements of Operations were as follows (in thousands):\nLease-related assets and liabilities were as follows (in thousands, except years and %):\nFuture minimum lease payments under non-cancellable leases as of December 31, 2021 were as follows (in thousands):\n(1) Future minimum lease payments for the years ending December 31, 2022, 2023 and 2024 are presented net of tenant improvement allowances of $6.0 million, $0.8 million, and $0.2 million, respectively.\n(2) Total future minimum lease payments include the current portion of lease liabilities recorded in Prepaid expenses and other current assets of $4.9 million on our Consolidated Balance Sheets, which relates to certain of our leases for which the lease incentives to be received exceed the minimum lease payments to be paid over the next twelve months.\n10. Commitments and Contingencies\nLiability to Landlord Insurance\nWe have a wholly owned subsidiary, Terra Mar Insurance Company, Inc., which was established in connection with reinsuring liability to landlord insurance policies offered to our customers by our third-party service provider. Each policy has a limit of $100 thousand per incident. We assume a 100% quota share of the liability to landlord insurance policies placed with our customers by our third-party service provider. We accrue for reported claims, and include an estimate of losses incurred but not reported by our property manager customers, in cost of revenue because we bear the risk related to all such claims. Our liability for reported claims and incurred but not reported claims as of December 31, 2021 and 2020 was $1.7 million and $1.5 million, respectively, and is included in Other current liabilities on our Consolidated Balance Sheets.\nIncluded in Prepaid expenses and other current assets as of December 31, 2021 and 2020 are $3.0 million and $2.7 million, respectively, of deposits held with a third party related to requirements to maintain collateral for this risk mitigation service.\nLegal Proceedings\nFrom time to time we may become involved in various legal proceedings, investigative inquiries, and other disputes arising from or related to matters incident to the ordinary course of our business activities. We are not currently a party to any legal proceedings, nor are we aware of any pending or threatened legal proceedings, that would have a material adverse effect on our business, operating results, cash flows or financial condition should such proceedings be resolved unfavorably.\nIndemnification\nIn the ordinary course of business, we may provide indemnification of varying scope and terms to customers, investors, directors and officers with respect to certain matters, including, but not limited to, losses arising out of our breach of any applicable agreements, services to be provided by us, or intellectual property infringement claims made by third parties. These indemnification provisions may survive termination of the underlying agreement and the maximum potential amount of future payments we could be required to make under these indemnification provisions may not be subject to maximum loss clauses and is indeterminable. We have not incurred any costs as a result of such indemnification obligations and have not recorded any liabilities related to such obligations in the Consolidated Financial Statements.\n11. Stockholders’ Equity\nAmended and Restated Certificate of Incorporation\nUpon the effectiveness of our Amended and Restated Certificate of Incorporation on June 25, 2015, the number of shares of capital stock that is authorized to be issued was increased to 325,000,000 shares, of which 250,000,000 shares are Class A common stock, 50,000,000 shares are Class B common stock and 25,000,000 are undesignated preferred stock. The Class A common stock, Class B common stock and preferred stock have a par value of $0.0001 per share.\nClass A Common Stock and Class B Common Stock\nExcept for voting rights, or as otherwise required by applicable law, the shares of our Class A common stock and Class B common stock have the same powers, preferences and rights and rank equally, share ratably and are identical in all respects as to all matters. The rights and preferences are as follows:\nDividend Rights. Subject to preferences that may apply to any shares of preferred stock outstanding at the time, the holders of outstanding shares of our Class A common stock and Class B common stock are entitled to receive dividends out of funds legally available at the times and in the amounts that our Board of Directors may determine.\nVoting Rights. The holders of our Class A common stock are entitled to one vote per share, and holders of our Class B common stock are entitled to 10 votes per share. The holders of our Class A common stock and Class B common stock will vote together as a single class on all matters submitted to a vote of our stockholders, unless otherwise required by Delaware law or our amended and restated certificate of incorporation. Delaware law could require either holders of our Class A common stock or holders of our Class B common stock to vote separately. In addition, our amended and restated certificate of incorporation requires the approval of the holders of at least a majority of the outstanding shares of our Class B common stock, voting as a separate class to approve a change-in-control transaction.\nConversion. Upon the closing of our initial public offering (\"IPO\"), all shares of our convertible preferred stock and common stock held prior to the offering were converted into shares of Class B common stock. Currently, each share of our Class B common stock is convertible at any time at the option of the holder into one share of our Class A common stock. In addition, each share of our Class B common stock will convert into one share of our Class A common stock upon any transfer, whether or not for value, except for certain transfers described in our amended and restated certificate of incorporation, including, without limitation, (i) a transfer by a partnership or limited liability company that was a registered holder of our Class B common stock at the “effective time,” as defined in our amended and restated certificate of incorporation, to a partner or member thereof at the effective time or (ii) a transfer to a “qualified recipient,” as defined in our amended and restated certificate of incorporation.\nAll the outstanding shares of our Class B common stock will convert automatically into shares of our Class A common stock upon the date when the number of outstanding shares of our Class B common stock represents less than 10% of all outstanding shares of our Class A common stock and Class B common stock. Once converted into our Class A common stock, our Class B common stock may not be reissued.\nRight to Receive Liquidation Distributions. Upon our dissolution, liquidation or winding-up, the assets legally available for distribution to our stockholders are distributable ratably among the holders of our Class A common stock and Class B common stock, subject to prior satisfaction of all outstanding debt and liabilities and the preferential rights and payment of liquidation preferences, if any, on any outstanding shares of preferred stock.\nPreferred Stock\nOur Board of Directors is authorized, subject to limitations prescribed by Delaware law, to issue up to 25,000,000 shares of our preferred stock in one or more series, to establish from time to time the number of shares to be included in each series, and to fix the designation, powers, preferences and rights of the shares of each series and any of its qualifications, limitations or restrictions, in each case without further action by our stockholders. The number of authorized shares of any series of preferred stock may be increased or decreased, but not below the number of shares of that series then outstanding, by the affirmative vote of the holders of a majority of the voting power of our outstanding capital stock entitled to vote thereon, or such other vote as may be required by the certificate of designation establishing the series.\nShare Repurchase Program\nOn February 20, 2019, our Board of Directors authorized a $100.0 million share repurchase program (the \"Share Repurchase Program\") relating to our outstanding shares of Class A common stock. Under the Share Repurchase Program, share repurchases may be made from time to time, as directed by a committee consisting of three directors, in open market purchases or in privately negotiated transactions at a repurchase price that the members of the committee unanimously believe is below intrinsic value conservatively determined. The Share Repurchase Program does not obligate us to repurchase any\nspecific dollar amount or number of shares, there is no expiration date for the Share Repurchase Program, which may be modified, suspended or terminated at any time and for any reason.\nDuring the year ended December 31, 2020, we repurchased a total of 48,002 shares of our Class A common stock through open market repurchases, and recorded a $4.2 million reduction to stockholders' equity, which includes broker commissions. We have not made any other repurchases under the Share Repurchase Program.\n12. Stock-Based Compensation\n2015 Stock Incentive Plan\nIn conjunction with our IPO in 2015, our Board of Directors and stockholders adopted the 2015 Stock Incentive Plan (the \"2015 Plan\"). Upon adoption of the 2015 Plan, 2,000,000 shares of our Class A common stock were reserved and available for grant and issuance. On January 1 of each subsequent calendar year, the number of shares available for grant and issuance under the 2015 Plan increase by the lesser of (i) the number of shares of our Class A common stock subject to awards granted under the 2015 Plan during the preceding calendar year and (ii) such lesser number of shares of our Class A common stock determined by our Board of Directors. At December 31, 2021, we have reserved an aggregate of 4,026,493 shares of our Class A common stock for grant and issuance under the 2015 Plan. The number of shares of our Class A common stock is also subject to adjustment in the event of a recapitalization, stock split, reclassification, stock dividend or other change in our capitalization. The 2015 Plan authorizes the award of stock options, stock appreciation rights, RSAs, RSUs, performance awards and stock bonuses. The 2015 Plan provides for the grant of awards to our employees, directors, consultants and independent contractors, subject to certain exceptions. RSUs, PSUs, and RSAs have been issued during 2021 pursuant to the 2015 Plan.\nStock options may vest based on the passage of time or the achievement of performance conditions at the discretion of our compensation committee. Our compensation committee may provide for stock options to be exercised only as they vest or to be immediately exercisable with any shares issued on exercise being subject to our right of repurchase that lapses as the shares vest. The maximum term of stock options granted under the 2015 Plan is 10 years.\nRSUs and PSUs represent the right on the part of the holder to receive shares of our Class A common stock at a specified date in the future or the achievement of performance conditions at the discretion of our compensation committee, subject to forfeiture of that right due to termination of employment. If an RSU or PSU has not been forfeited, then, on the specified date, we will deliver to the holder of the RSU or PSU shares of our Class A common stock.\n2007 Stock Incentive Plan\nOn February 14, 2007, our Board of Directors adopted the 2007 Stock Incentive Plan (the “2007 Plan”). Following our IPO, our Board of Directors determined not to make any further awards under the 2007 Plan. The 2007 Plan expired on February 14, 2017. The 2007 Plan will continue to govern outstanding awards granted under the 2007 Plan.\nStock Options\nA summary of activity in connection with our stock options for the year ended December 31, 2021 is as follows (number of shares in thousands):\nOur stock-based compensation expense for stock options were not material for all periods presented.\nNo stock options were granted during the years ended December 31, 2021, 2020 or 2019.\nThe total intrinsic value of options exercised in 2021, 2020 and 2019 was $39.1 million, $17.9 million, and $11.5 million, respectively. This intrinsic value represents the difference between the fair value of our common stock on the date of exercise and the exercise price of each option. Based on the fair value of our common stock at December 31, 2021, the total intrinsic value of all outstanding options, exercisable options, and options vested and expected to vest was $91.3 million.\nRestricted Stock Units\nA summary of activity in connection with our RSUs for the year ended December 31, 2021 is as follows (number of shares in thousands):\nUnvested RSUs as of December 31, 2021 were comprised of 0.6 million RSUs with only service conditions and 0.2 million PSUs with both service conditions and performance conditions. RSUs granted with only service conditions generally vest over a four-year period. The number of PSUs granted, as included in the above table, assumes achievement of the performance metric at 100% of the performance target. Of the unvested PSUs as of December 31, 2021, 0.1 million are subject to vesting based on the achievement of pre-established performance metrics for the year ending December 31, 2022 and will vest over a three year period, assuming continued employment throughout the performance period. The actual number of shares to be issued at the end of the performance period will range from 0% to 150% of the target number of shares depending on achievement relative to the performance metric over the applicable period. The remaining 0.1 million PSUs unvested as of December 31, 2021 are subject to vesting based on the achievement of pre-established performance metrics for the years ending December 31, 2021, 2022 and 2023, assuming continued employment throughout the performance period. The actual number of shares to be issued at the end of the performance period will range from 0% to 100% of the initial target awards. Achievement of the performance metric between 100% and 150% of the performance target will result in a performance-based cash bonus payment between 0% and 65% of the initial target awards.\nWe recognized stock-based compensation expense for the RSUs and PSUs of $17.3 million, $10.4 million and $8.3 million for the years ended December 31, 2021, 2020 and 2019, respectively. Excluded from stock-based compensation expense is capitalized software development costs of $2.7 million, $2.1 million, and $1.8 million for the years ended December 31, 2021, 2020 and 2019, respectively. As of December 31, 2021, the total estimated remaining stock-based compensation expense for the aforementioned RSUs and PSUs was $76.5 million, which is expected to be recognized over a weighted average period of 2.7 years. The total fair value of RSUs and PSUs vested during the years ended December 31, 2021, 2020 and 2019 was approximately $26.6 million, $32.0 million and $16.3 million, respectively.\nRestricted Stock Awards\nA summary of activity in connection with our RSAs for the year ended December 31, 2021 is as follows (number of shares in thousands):\nWe have the right to repurchase any unvested RSAs subject to certain conditions. Restricted stock awards vest over a one-year period. We recognized stock-based compensation expense for restricted stock awards of $0.7 million and for each of the years ended December 31, 2021, and 2020 and $0.3 million for the ended December 31, 2019. During 2021, the grant date fair value of the shares vested was $0.7 million.\nAs of December 31, 2021, the total estimated remaining stock-based compensation expense for unvested restricted stock awards with a repurchase right was $0.3 million, which is expected to be recognized over a weighted average period of 0.5 years.\n13. Income Taxes\nThe effective tax rate as compared to the U.S. federal statutory rate of 21% differs primarily due to the significance of the benefits associated with stock-based compensation expense, research and development tax credits, and the change in the valuation allowance against deferred taxes.\nSet forth below is a reconciliation of the components that caused our provision for (benefit from) income taxes to differ from amounts computed by applying the United States federal statutory rate :\nThe provision for (benefit from) income tax consists of the following (in thousands):\nThe components of deferred tax assets (liabilities) were as follows (in thousands):\nAt December 31, 2021, we had federal and state net operating loss carryforwards of $23.8 million and $69.6 million, respectively. The federal net operating loss carryovers do not expire and the state net operating losses will begin to expire in 2028. At December 31, 2021, we also had federal and state research and development credit carryforwards of $8.5 million and $15.2 million, respectively. The federal credit carryforwards will begin to expire in 2040, while the state credit carryforwards apply indefinitely.\nThe Internal Revenue Code of 1986, as amended (“IRC”), imposes substantial restrictions on the utilization of tax attributes in the event of an “ownership change” of a corporation. Accordingly, a company’s ability to use pre-change tax attributes may be limited as prescribed under IRC Section 382. Events which may cause limitations in the amount of the tax attributes that we utilize in any one year include, but are not limited to, a cumulative ownership change of more than 50% over a rolling three-year period. We have undertaken an IRC Section 382 analysis and have determined that there are no limitations on the tax attributes at December 31, 2021.\nAs of December 31, 2021, we have approximately $1.7 million of net deferred tax liabilities. During the fourth quarter of 2021, to assess the need for a valuation allowance against deferred tax assets, we evaluated all available positive and negative evidence. Due to the amount of negative evidence, particularly the expected increase in forecasted expenses, at this time, we consider it more likely than not that we may not have sufficient taxable income in the future that will allow us to realize all of our deferred tax assets. As a result,we determined a valuation allowance was necessary against all of the net deferred income tax assets, which primarily consist of state R&D tax credit carryforwards, effective December 31, 2021.\nThe change in the valuation allowance are as follows (in thousands):\nThe following is a reconciliation of the total amounts of reserves for unrecognized tax benefits from uncertain tax positions (in thousands):\nThe unrecognized tax benefits are recorded as a reduction to the deferred tax assets and liabilities.\nAt December 31, 2021 and 2020, we had no accrued interest and penalties related to uncertain income tax positions. We do not anticipate that the amount of unrecognized tax benefits will significantly increase or decrease within the next twelve months.\nWe are subject to taxation in the United States and various states. Due to the net operating loss carryforwards, our federal and state returns are open to examination by the Internal Revenue Service and state jurisdictions for all years since inception. We are under audit only by the State of New York.\n14. Revenue and Other Information\nThe following table presents our revenue categories (in thousands):\nOur revenue is generated primarily from United States customers. All of our property and equipment is located in the United States.\n15. Retirement Plans\nWe have a 401(k) retirement and savings plan made available to all employees. We may, at our discretion, make matching contributions to the 401(k) plan. Cash contributions to the plan were $4.0 million, $3.2 million, and $2.5 million for the years ended December 31, 2021, 2020 and 2019, respectively.",
    "item_9": "ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone.",
    "item_9A": "ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the supervision and participation of our principal executive officer and principal financial officer, evaluated the effectiveness of our disclosure controls and procedures at December 31, 2021, the last day of the period covered by this Annual Report. Disclosure controls and procedures include, without limitation, controls and other procedures designed to provide reasonable assurance that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified by the SEC’s rules and forms and that such information is accumulated and communicated to its management, including its principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure. Based on our management's evaluation, our principal executive officer and principal financial officer have concluded that, at December 31, 2021, our disclosure controls and procedures were effective at the reasonable assurance level.\nManagement's Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Internal control over financial reporting is a process designed under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness of the internal control over financial reporting to future periods are subject to the risk that the controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of December 31, 2021, our management assessed the effectiveness of our internal control over financial reporting using the criteria set forth in the Internal Control - Integrated Framework (2013) as issued by the Committee of Sponsoring Organizations (COSO) of the Treadway Commission. Based on our evaluation under the COSO criteria, our management concluded that our internal control over financial reporting was effective at the reasonable assurance level as of December 31, 2021.\nThe effectiveness of our internal control over financial reporting has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in their audit report which expresses an unqualified opinion on the effectiveness of our internal control over financial reporting at December 31, 2021.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting identified in connection with the evaluation required by Rules 13(a)-15(d) and 15d-15(d) under the Exchange Act that occurred during the quarter ended December 31, 2021 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.",
    "item_9B": "ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURES REGARDING FOREIGN JURISDICTION THAT PREVENT INSPECTIONS\nNot applicable.\nPART III",
    "item_10": "ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this item will be included in our definitive Proxy Statement or an amendment to this Annual Report, which will be filed with the SEC not later than 120 days after the end of our fiscal year ended December 31, 2021, and is incorporated herein by reference.",
    "item_11": "ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this item will be included in our definitive Proxy Statement or an amendment to this Annual Report, which will be filed with the SEC not later than 120 days after the end of our fiscal year ended December 31, 2021, and is incorporated herein by reference.",
    "item_12": "ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this item will be included in our definitive Proxy Statement or an amendment to this Annual Report, which will be filed with the SEC not later than 120 days after the end of our fiscal year ended December 31, 2021, and is incorporated herein by reference.",
    "item_13": "ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item will be included in our definitive Proxy Statement or an amendment to this Annual Report, which will be filed with the SEC not later than 120 days after the end of our fiscal year ended December 31, 2021, and is incorporated herein by reference.",
    "item_14": "ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this item will be included in our definitive Proxy Statement or an amendment to this Annual Report, which will be filed with the SEC not later than 120 days after the end of our fiscal year ended December 31, 2021, and is incorporated herein by reference.\nPART IV",
    "item_15": "ITEM 15. EXHIBITS, FINANCIAL STATEMENTS SCHEDULES\nThe following documents are filed as part of this Annual Report:\n1.Consolidated Financial Statements\nOur consolidated financial statements are listed in the “Index to Consolidated Financial Statements” under Part II, Item 8, of this Annual Report.\n2.Financial Statement Schedules\nAll financial statement schedules have been omitted because they are not required or are not applicable, or the required information is shown in our Consolidated Financial Statements or the notes thereto.\n3.Exhibits\nThe documents listed in the Exhibit Index of this Annual Report are filed or furnished with, or incorporated by reference into, this Annual Report, in each case as indicated therein.\nEXHIBIT INDEX\nIncorporated by Reference\nExhibit Number Exhibit Description Form File No. Exhibit Filing Date Filed Herewith\n3.1 Amended and Restated Certificate of Incorporation of the registrant as currently in effect.\n10-Q 001-37468 3.1 8/6/2015\nIncorporated by Reference\nExhibit Number Exhibit Description Form File No. Exhibit Filing Date Filed Herewith\n3.2 Amended and Restated Bylaws of the registrant as currently in effect.\n10-Q 001-37468 3.2 8/6/2015\n4.1 Specimen Certificate for Class A Common Stock.\nS-1/A 333-204262 4.1 6/4/2015\n4.2 Amended and Restated Investor Rights Agreement, by and among the registrant and the investors named therein, dated November 26, 2013.\nS-1/A 333-204262 4.2 6/4/2015\n4.3 Description of Capital Stock of the registrant.\n10-K 001-37468 4.3 3/2/2020\n10.1 Industrial Lease, by and between the registrant and 50 Castilian Drive, LLC, effective December 6, 2019 (50 Castilian Drive, Goleta, CA 93117).\n8-K 001-37468 10.1 12/11/2019\n10.2 Industrial Lease, by and between the registrant and 50 Castilian Drive, LLC, effective December 6, 2019 (70 Castilian Drive, Goleta, CA 93117).\n8-K 001-37468 10.2 12/11/2019\n10.3 Industrial Lease, by and between the registrant and 50 Castilian Drive, LLC, effective December 6, 2019 (90 Castilian Drive, Goleta, CA 93117).\n8-K 001-37468 10.3 12/11/2019\n10.4 First Amendment to Industrial Lease, by and between the registrant and 50 Castilian Drive, LLC, effective February 10, 2022 (50 Castilian Drive, Goleta, CA 93117).\nX\n10.5 First Amendment to Industrial Lease, by and between the registrant and 50 Castilian Drive, LLC, effective February 10, 2022 (70 Castilian Drive, Goleta, CA 93117).\nX\n10.6 First Amendment to Industrial Lease, by and between the registrant and 50 Castilian Drive, LLC, effective February 10, 2022 (90 Castilian Drive, Goleta, CA 93117).\nX\n10.7 Umbrella Termination Agreement, by and between the registrant and Castilian 90, LLC, Castilian 70, LLC and Castilian 50, LLC, effective February 10, 2022.\nX\n10.8 Separation Agreement and General Release, dated June 4, 2021, by and between Ida Kane and the registrant.\n10-Q 001-37468 10.1 8/9/2021\n10.9# 2007 Stock Incentive Plan, as amended, and related form agreements.\nS-1/A 333-204262 10.3 6/4/2015\n10.10# 2015 Stock Incentive Plan and related form agreements.\nS-1/A 333-204262 10.4 6/4/2015\n10.11# 2015 Employee Stock Purchase Plan.\nS-1/A 333-204262 10.5 6/4/2015\n10.12# Long-Term Cash Incentive Plan.\n10-K 001-37468 10.9 2/26/2018\n10.13# Form of Long-Term Cash Incentive Award Offer.\n10-K 001-37468 10.10 2/26/2018\n10.14 Form of Indemnification Agreement by and between the registrant and each of its executive officers and directors.\nX\n10.15# Employment agreement between the Company and Fay Sien Goon.\n10-Q 001-37468 10.1\n10.16# Form of Restricted Stock Unit Award Agreement (New Hire) under 2015 Stock Incentive Plan.\nX\nIncorporated by Reference\nExhibit Number Exhibit Description Form File No. Exhibit Filing Date Filed Herewith\n10.17# Form of Restricted Stock Unit Award Agreement (Refresh) under 2015 Stock Incentive Plan.\nX\n10.18# Form of Restricted Stock Unit Award Agreement (PSU) under 2015 Stock Incentive Plan.\nX\n10.19# Nonemployee Director Deferred Compensation Plan.\nX\n10.20# Related form of Deferral Election under Nonemployee Director Deferred Compensation Plan.\nX\n21.1 Subsidiaries of the registrant.\nX\n23.1 Consent of independent registered public accounting firm.\nX\n24.1 Power of Attorney (included on the signature page of this report).\nX\n31.1 Certification of Chief Executive Officer pursuant to Rule 13a-14(a) or Rule 15d-14(a) promulgated under the Securities Exchange Act of 1934, as amended.\nX\n31.2 Certification of Chief Financial Officer pursuant to Rule 13a-14(a) or Rule 15d-14(a) promulgated under the Securities Exchange Act of 1934, as amended.\nX\n32.1* Certifications of Chief Executive Officer and Chief Financial Officer, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n101.SCH XBRL Taxonomy Extension Schema Document. X\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document. X\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document. X\n101.LAB XBRL Taxonomy Extension Label Linkbase Document. X\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document. X\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101) X\n# Indicates a management contract or compensatory plan or arrangement\n* The certifications attached as Exhibit 32.1 accompany this Annual Report pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, and shall not be deemed “filed” by the registrant for purposes of Section 18 of the Exchange Act and are not to be incorporated by reference into any of the registrant’s filings under the Securities Act or the Exchange Act, irrespective of any general incorporation language contained in any such filing.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this Annual Report to be signed on its behalf by the undersigned thereunto duly authorized.\nAppFolio, Inc.\nDate: February 28, 2022 By: /s/ Jason Randall\nJason Randall\nChief Executive Officer\n(Principal Executive Officer)\nDate: February 28, 2022 By: /s/ Fay Sien Goon\nFay Sien Goon\nChief Financial Officer\n(Principal Financial Officer)\nDate: February 28, 2022 By: /s/ Ann Wilson\nAnn Wilson\nVice President of Accounting\n(Principal Accounting Officer)\nSIGNATURE\nTITLE DATE\n/s/ Jason Randall President, Chief Executive Officer and Director\n(Principal Executive Officer) February 28, 2022\nJason Randall\n/s/ Fay Sien Goon Chief Financial Officer\n(Principal Financial Officer) February 28, 2022\nFay Sien Goon\n/s/ Ann Wilson Vice President, Accounting\n(Principal Accounting Officer) February 28, 2022\nAnn Wilson\n/s/ Andreas von Blottnitz\nChairman of the Board February 28, 2022\nAndreas von Blottnitz\n/s/ Timothy Bliss\nDirector February 28, 2022\nTimothy Bliss\n/s/ Agnes Bundy Scanlan Director February 28, 2022\nAgnes Bundy Scanlan\n/s/ Janet Kerr Director February 28, 2022\nJanet Kerr\n/s/ Klaus Schauser\nDirector February 28, 2022\nKlaus Schauser\n/s/ Winifred Webb Director February 28, 2022\nWinifred Webb\n/s/ Alexander Wolf Director February 28, 2022\nAlexander Wolf"
}